Repository: amyxzhang/wikum
Catalog: wikum/website/locale/*/LC_MESSAGES/djangojs.po
Languages: es

source: Tag this comment.
es: Etiquetar comentario.

source: Current tags:
es: Etiquetas actuales:

source: Add tag:
es: Añadir etiqueta:

source: New tag
es: Nueva etiqueta

source: Suggested tags:
es: Etiquetas sugeridas:

source: Tags:
es: Etiquetas:

source: Original Comment:
es: Comentario Original:

source: Replies:
es: Respuestas:

source: Hide the replies to this original comment from view.
es: Ocultar todas las respuestas a este comentario original

source: Summary Node:
es: Árbol de resúmenes

source: Summary:
es: Resumen

source: Hide all these comments from view.
es: Ocultar todos los comentarios

source: Cite Paragraph
es: Citar párrafo

source: Highlight top sentences
es: Resaltar las oraciones principales

source: Summarize this comment.
es: Resumir comentario

source: Quote
es: Cita

source: Cite Comment
es: Citar Comentario

source: Summarize this comment and all replies (replaces them all).
es: Resumir este comentario y todas sus respuestas (reemplazar todas ellas).

source: This summary will be deleted.
es: Este resumen será eliminado.

source: Undo
es: Deshacer

source: Show summary below the fold
es: Mostrar resumen debajo

source: Your change is saved!
es: Tu cambio ha sido guardado!

source: Sorry, an error occurred.
es: Lo sentimos, se ha producido un error.

source: Filter by tag
es: Filtrar por etiqueta

source: Highlight text
es: Resaltar texto

source: View Original Comment
es: Ver Comentario Original

source: Delete Comment Summary
es: Eliminar Resumen de Comentario

source: Summarize Comment
es: Resumir comentario

source: Tag Comment
es: Etiquetar Comentario

source: Mark Unimportant
es: Marcar como irrelevante

source: Show Hidden Comments
es: Mostrar Comentarios Ocultos

source: Summarize Comment + Replies
es: Resumir comentario + Respuestas

source: Mark Replies Unimportant
es: Marcar Respuesta como Irrelevante

source: Show parent summary
es: Mostrar elresumen padre

source: Click on a node to see it and its children or drag to select multiple nodes.
es: Click en el nodo para visualizarlo o arrastra para seleccionar multiples nodos

source: See Isolated Subtree
es: Ver Subarbol Aislado

source: Expand all Summaries
es: Expandir todos los Resumenes

source: Show
es: Mostrar

source: Hidden
es: Ocultos

source: Rehide hidden
es: Reocultar ocultos

source: Collapse replies
es: Plegar respuestas

source: Expand replies
es: Desplegar respuestas

source: See Entire Discussion
es: Ver la Conversacion Completa

source: Show
es: Mostrar

source: hidden
es: ocultos

source: hidden
es: ocultos

source: Sort all by - ID
es: Ordenar por - ID

source: Sort all by - # Likes
es: Ordenar por - # Me gusta

source: Sort all by - # Replies
es: Ordenar por - # Respuestas

source: Sort all by - Longest
es: Ordenar por - Mas largos

source: Sort all by - Shortest
es: Ordenar por - Mas cortos

source: Sort all by - Newest
es: Ordenar por - Mas recientes

source: Sort all by - Oldest
es: Ordenar por - Mas antiguos

source: Likes
es: Me gusta

source: Replies
es: Respuestas

source: Longest
es: Más largos

source: Shortest
es: Más cortos

source: Newest
es: Más nuevos

source: Oldest
es: Más viejos

source: Get next page of comments
es: Siguiente página de comentarios
