Repository: amyxzhang/wikum
Catalog: wikum/website/locale/*/LC_MESSAGES/django.po
Languages: es

source: Delete Account
es: Eliminar cuenta

source: Delete My Account
es: Eliminar cuenta

source: Confirm Email
es: Confirmar email

source: Confirm email address
es: Confirmar correo electrónico

source: Confirm
es: Confirmar

source: Confirm your email address
es: Confirmar correo electrónico

source: We have sent you an email to
es: Te hemos enviado un correo de confirmación a

source: for verification. Follow the link provided to finalize the signup process. If you do not receive it within a few minutes, contact us at
es: . Sigue el link para finalizar el proceso de registro. Si después de unos minutos no has recibido el correo, contáctanos.

source: Go back
es: Regresar

source: Email confirmed
es: Email confirmado

source: You have confirmed
es: Tu correo ha sido confirmado

source: Log in to an existing account
es: Entrar a una cuenta existente

source: Log in
es: Entrar

source: Forgot your password?
es: Olvidaste tu contraseña?

source: Don't have an account?
es: Aún no tienes una cuenta?

source: Sign up
es: Regístrate

source: Change Password
es: Cambiar contrasena

source: Logout
es: Salir

source: About
es: Qué es

source: Contact
es: Contacto

source: Login
es: Entrar

source: Sign Up
es: Registrarse

source: Edit History
es: Historial de ediciones

source: User
es: Usuario

source: Time
es: Tiempo

source: From
es: De

source: To
es: A

source: Explanation
es: Explicación

source: Hide Comment
es: Ocultar comentario

source: Summarize Comment
es: Resume largos hilos de conversaciones

source: Edit Summary of a Comment
es: Editar resumen del comentario

source: Hide All Replies of a Comment
es: Ocultar todas las respuestas al comentario

source: Hide Multiple Comments
es: Ocultar multiples comentarios

source: Summarize Subtree
es: Resumir Subarbol

source: Summarize Group of Comments
es: Resume largos hilos de conversaciones

source: Edit Summary of Subtree
es: Editar el resumen en subarbol

source: Move Comment
es: Mover comentario

source: Tag Comment
es: Etiquetar comentario

source: Tag Comments
es: Etiquetar comentarios

source: Anonymous
es: Anonimo

source: Comment Hidden
es: Comentario oculto

source: All Comments Hidden
es: Comentarios ocultos

source: Move CommentMove Comment
es: Mover comentario

source: Summarize long comment threads
es: Sintetiza largos hilos de conversaciones

source: Import Discussion
es: Importar discusión

source: Done
es: Completado

source: Source
es: Fuente

source: Discussion
es: Discusión

source: Comments
es: Comentarios

source: Summaries
es: Resumenes

source: About Wikum
es: Qué es Wikum

source: Wikum is a tool for summarizing and exploring long comment threads.
es: Wikum es una herramienta para crear resúmenes de grandes comentarios en largas conversaciones

source: Wikum: Bridging Discussion Forums and Wikis using Recursive Summarization
es: Wikum:Foros de discusiones y Wikis usando Resúmenes Recursivos

source: Large-scale discussions between many participants abound on the internet today, on topics ranging from political arguments to group coordination.
es: Las discusiones a gran escala entre muchos participantes abundan hoy en Internetdesde temas que van desde argumentos políticos hasta la coordinación grupal

source: But as these discussions grow to tens of thousands of posts, they become ever more difficult for a reader to digest.In this article, we describe a workflow called
es: Pero a medida que estas discusiones crecen a decenas de miles de publicaciones, se vuelven cada vez más difíciles de digerir para un lector. En este articulo, describimos un flujo de trabajo llamado

source: recursive summarization
es: resumen recursivo

source: , implemented in our
es: , implementado en nuestro prototipo

source: prototype, that enables a large population of readers or editors to work in small doses to refine out the main points of the discussion. More than just a single summary, our workflow produces a
es: , que permite que una gran cantidad de lectores o editores trabajeen pequeñas dosis para refinar los puntos principales de la discusión. Más que un solo resumen, nuestro flujo de trabajo produce un

source: summary tree
es: árbol de resúmenes

source: that enables a reader to explore distinct subtopics at multiple levels of detail based on their interests.
es: que permite a un lector explorar subtemas distintos en múltiples niveles de detalle según sus intereses.

source: slides and talk
es: Presentaciones y Pláticas

source: Contact Us
es: Contáctanos

source: Import a Discussion
es: Importar discusión

source: Import a new discussion by pasting an Atlantic article url, Reddit page url, or Wikipedia Talk page section url here.
es: Pega una url de Reddit, Atlantic o Wikipedia para importar una discusión

source: Submit
es: Aceptar

source: View Wikum Editing Interface
es: Ver la interfáz de edición de Wikum

source: Full threading view, Auto-horizontal scrolling, No context
es: Full threading view, Desplazamiento horizontal automático, 3 Niveles de contexto

source: Interface:
es: interfáz:

source: Full threading view, Auto-horizontal scrolling, 3 levels of context
es: Full threading view, Desplazamiento horizontal automático, 3 Niveles de contexto

source: Partial threading view, 3 levels of context
es: Vista parcial, 3 Niveles de contexto

source: Partial threading view, No context
es: Vista parcial, Sin contexto

source: of this page summarized
es: de esta página esta resumido

source: Leave a note as to why this comment should be hidden (optional):
es: Deja una nota indicando por qué este comentario deberia de ser ocultado (opcional):

source: Close
es: Cerrar

source: Summarize Comments
es: Resumir comentarios

source: Summary:
es: Resumen:

source: Summarize Multiple Comments
es: Resumen de multiples comentarios
