{"article": true, "children": [{"author": "CuriousGeorgeOrwell", "children": [{"author": "deruman", "children": [{"author": "Peterg123", "children": [], "name": "<p>I can absolutely assure you, when you listen to Barf,Psaki,Earnest etc, that they are not getting any advice from Haykel and woods..</p>", "size": 40}, {"author": "HardCopy718", "children": [{"author": "iyedb", "children": [], "name": "<p>Then He probably should have related Isis to this <a href=\"http://en.m.wikipedia.org/wiki/Khawarij\" rel=\"nofollow\">http://en.m.wikipedia.org/wiki...</a></p>", "size": 0}], "name": "<p>Haykel might be the most practical, level-headed academic I've ever seen speak on any topic.</p>", "size": 20}, {"author": "disqus_19LOvVhk9g", "children": [{"author": "deruman", "children": [{"author": "disqus_19LOvVhk9g", "children": [{"author": "deruman", "children": [{"author": "disqus_19LOvVhk9g", "children": [], "name": "<p>As I suspected.  Mere sneer.  How useless.  <br>Explains why you hide your history of poisonous contempt. \"Private\"</p>", "size": 0}], "name": "<p>Compliment?</p>", "size": 0}], "name": "<p>A barbed compliment ?  <br>So innovative.  <br>So contradictory.</p>", "size": 0}], "name": "<p>Definitely food for thought, if not thinkers.</p>", "size": 1}], "name": "<p>Hi Deruman.  <br>If the analysis of islam is of interest, you will find \"Story of Mohammed Islam Unveiled.pdf\" offers an inDepth accounting of the basis of ISIS' thinking.</p><p>I too hope that the global decision-makers are making use of David's clarity.  <br>As a journalist, David Wood has refrained from extrapolating from his analysis towards the origins of Islam [asking for a fatwah]</p><p>Harry Richardson attributes it all to Mohammed, but in so doing, he ignores the possibility of a nonhuman author, even though Mohammed openly attributes it to the same phenomenon as was documented in-depth and scrupulously analysed by John Keel in jk_oth.pdf.</p><p>John called them \"ultraTerrestrials\" and concluded that they exploit mankind for an undisclosed agenda.  <br>The Toltec give the best inDepth description of the authors of our religions [complete with modus operandi ] in the Mud Shadows chapter of \"The Active Side of Infinity.rtf\"</p><p>Plenty of food for thought in those references.</p>", "size": 0}, {"author": "iyedb", "children": [], "name": "<p><a href=\"http://en.m.wikipedia.org/wiki/Khawarij\" rel=\"nofollow\">http://en.m.wikipedia.org/wiki...</a></p>", "size": 0}], "name": "<p>Agree.  The best reporting and analysis I've seen on Islam or ISIS.  I also researched Bernard Haykel, the Princeton scholar Wood cites.  I hope our government is getting advice from these people.</p>", "size": 145}, {"author": "SeptimusSmith", "children": [], "name": "<p>I'll respond and say that I--who have tussled with you before GeorgeOrwellGeorge, and who am probably the kind of Atlantic readership you had in mind--agree that this is a thoughtful and important piece.</p>", "size": 60}, {"author": "jayeellis", "children": [{"author": "cantshakeme", "children": [{"author": "disqus_pvsGka63Pn", "children": [{"author": "Anonymous", "children": [], "name": "<p>ok sorry. Birdie is the dullest tool in the bed, er shed</p>", "size": 0}], "name": "<p>That's not a response.</p>", "size": 3}, {"author": "Anonymous", "children": [], "name": "<p>please put W.S Byrd before the word you used. thank-you</p>", "size": 0}, {"author": "disqus_19LOvVhk9g", "children": [], "name": "<p>projection</p>", "size": 0}], "name": "<p>Moron. </p>", "size": 15}, {"author": "disqus_19LOvVhk9g", "children": [], "name": "<p>Well said, Jaye.  <br>Political Correctness is an ideologicaol blindness, as sinister as ISIS.  <br>The world was unprepared for Hitler &amp; Stalin, <br>and what a price we paid for wishful thinking back then.</p><p>Political Correctness does not allow the perception of hidden agendas.  <br>It insists we should all be friends, despite many ghastly lessons from history.</p><p>To understand the dynamics of this world, we must go beyond comforting ideologies, and deal with the facts at face value. [ie: without preemptive assumptions originating from common beliefs]</p>", "size": 0}, {"author": "disqus_X7QPpXQW97", "children": [], "name": "<p>Hi Jaye. They're not making a mistake - not in their terms. They would be if they wanted support from anyone but jihadis. But they don't. They are genocidal &amp; want to kill several billion non-muslims &amp; non-jihadi-muslims. It's absolutely immaterial to them whether liberals view them as victims or not. They aim to kill us all.</p>", "size": 0}], "name": "<p>I think there is something of a PC breakout in Liberal areas regarding the subject of Islamic extremist terrorists.</p><p>These Islamic extremist terrorists are now targeting:</p><p>Cartoonists<br>Western Reporters<br>Jewish people and Jewish businesses</p><p>It is simply getting impossible for Liberal people to make these people the good guys, misunderstood, victims of oppression.</p><p>Some lame, lying liberals in the Obama State Department push old the Same Old, Same Old spin that we must address...</p><p>The root causes that prompt people to join ISIS, that's it's all about poverty, RACISM etc.</p><p>But fewer and fewer Liberal Western people are going for this.</p><p>Islamic terrorists are making huge mistake targeting Liberal Left groups and areas like bombing the Boston Marathon. If Islamic extremists just targeting Conservative, military people, targets in Texas and the US South, then yeah, Liberals would cover for them.</p>", "size": 17}, {"author": "carlosperdue", "children": [{"author": "charlesjustice", "children": [{"author": "carlosperdue", "children": [{"author": "charlesjustice", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "charlesjustice", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "charlesjustice", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "charlesjustice", "children": [{"author": "disqus_19LOvVhk9g", "children": [], "name": "<p>You left out Winston Churchill, the great visionary of a better democracy, the whistleBlower on Hitler and Stalin, and hero of the British resistance to fascism.  His 1896 remarks on Islam in \"The River War\" are prescient.  <br>I like your thinking.  An insightful synopsis from Charles Justice.</p>", "size": 0}], "name": "<p>It wouldn't have made a difference if the U.S. stayed or left, the genie left the bottle.  Same thing happened in Syria, for the same reason:  sectarianism.  The only thing that will settle the region will be a line in the sand between Shiites and Sunnis.  As to planning and acting on longer cycles dream on.  Nobody understands the longer cycles, and besides we are in democracies where the focus is always on the short-term.  Exceptions:  FDR and Teddy Roosevelt, Eisenhower.</p>", "size": 5}], "name": "<p>Maybe there has been no need for a short while between the end of the cold war and the rise of Putin, but otherwise you are wrong.<br>NATO served a very important role in the balance of power during the Cold War.</p><p>Once the US decided to invade, it effectively took on a responsiblity that went with being there.<br>Leaving was effectively dropping the ball.</p><p>Either the US should not have gone in.<br>But once in, the US should have stayed until at least Iraq was re-structured and stable.<br>Biggest problem with the US is that both Americans and the people they elect operated on a very short cycle.<br>Some countries plan and act on the generation cycle, which in the long term gives them a huge advantage.<br>It's like a football team that ONLY focuses on the next play, as opposed to playing a strategy for the complete game.</p>", "size": 1}], "name": "<p>There has been no need to keep American troops in Europe for the last fifty years.  More a display of dominance than anything else.  The fact that the US invaded Iraq and created 'regime change' was enough to create a whole new dynamic with Iran because of Iraqi Shiite affinities that had been up-till-then kept in check by the previous regime. Once the U.S. invaded that dynamic came into play and was unstoppable, no matter what U.S. policy.</p>", "size": 6}, {"author": "Anonymous", "children": [{"author": "russellbyrd", "children": [{"author": "Anonymous", "children": [{"author": "russellbyrd", "children": [{"author": "Anonymous", "children": [{"author": "russellbyrd", "children": [{"author": "Anonymous", "children": [{"author": "russellbyrd", "children": [], "name": "<p>This is a happy time.</p><p>Just not for Dickie.</p>", "size": 0}], "name": "<p>think of happier times</p>", "size": 0}], "name": "<p>Dickie brain need drain</p><p>Too much splooge, cannot bake</p>", "size": 0}], "name": "<p>quick bake yer brain</p>", "size": 0}], "name": "<p>I wouldn't bother with your blather.  Fixations on inane cartoons seems to be shared with your and Shitzilla's creator.  Sorry Dickie.</p>", "size": 1}], "name": "<p>Ok. I am Phelou Birdemic. I am on YouTube. I see your girl is shown during the first 10 seconds.</p><p><a href=\"https://www.youtube.com/watch?v=KkZpUwhOIfU&amp;noredirect=1\" rel=\"nofollow\">https://www.youtube.com/watch?...</a></p>", "size": 0}], "name": "<p>@ TROLL  Known name shifting troll.</p><p>Flagged and reported.  This troll admits that he is going to create me another Facebook page like he did last night.  He stole my property and used it in a libelous manner, and has threatened to do so again.  Text has been logged, and though he has erased the page, it was saved in its entirety.</p><p>He is only safe from prosecution until his true ID is divulged...</p>", "size": 1}, {"author": "disqus_19LOvVhk9g", "children": [], "name": "<p>Not asking.  Snide gloating.  disHonest and nasty comment.</p>", "size": 0}], "name": "<p>Just noticed, W.S. Byrd's' words don't filter out into the \"Best Of\" on this comment section. (How could that be? Is there something that could be done to help W.S. to move up?  just askin' )</p>", "size": 1}], "name": "<p>As a consequence of WWII, we kept active troops in Europe and Asia.<br>As a Matter of fact, we still have troops there..</p><p>It should also be noted, that Allied troups were still active in Europe 5+ years after the end of WWII, dealing Axis holdouts.</p><p>So yeah, It would have been far cheaper to keep troops is Irag and continue pacification, than the costs we are now going to incur, with the creation of the vacuum that led ISIS.</p><p>It's like the old FRAM add.<br>\"Pay me now, or pay me later\"<br>Well, now we're going to have to pay for it later. And from past experience, we KNOW that it's going to cost a lot more.<br>Particularly since Obambi is doing a really good imitation of Neville Chamberlain.</p>", "size": 4}], "name": "<p>Was the US to keep its troops in Iraq indefinitely?  Before the invasion Iraq's Sunnis and Shiites coexisted and intermarried.  Iraq was Iran's biggest enemy.  After the invasion  continual sectarian violence, massive uprooting and exile of Iraqi ethnic groups.  Plus as a bonus, Iran came to have far more influence in Iraq than the United States.  How is that for unintended consequences?</p>", "size": 8}], "name": "<p>The power vacuum that created ISIS was created when Obambi pulled to troops out.</p><p>Get some help for your BDS.</p>", "size": 5}, {"author": "carlosperdue", "children": [], "name": "<p>Nice try. Another cowardly diversion and evasion of the argument. First you do a little weakminded wussie hit &amp; run cheap shot, now you come back and change the subject, since you're still incapable of intelligently addressing the argument. You just know you don't like it. You don't really know why, but you don't like it, so you lash out like an ignoranus.</p><p>Nevertheless, I largely agree with your statement. Bouncing Saddam was the stupidest foreign policy blunder since Carter helped bounce the Shah of Iran. Our down-low Hajji President, Comrade Commander B Hussein O, screwed it up even worse of course, but he never should've had the chance, since Bush never should've invaded Iraq in the first place.</p><p>BTW, what is that you're wearing, some hippy dippy \"liberal\" tree-hugger costume?</p>", "size": 0}, {"author": "carlosperdue", "children": [], "name": "<p>Is that why they didn't have to invade Iraq, genius?</p>", "size": 0}, {"author": "northernobserver", "children": [{"author": "charlesjustice", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "charlesjustice", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "charlesjustice", "children": [{"author": "disqus_hh6Xrjtbul", "children": [], "name": "<p>I'm not the one who made a superficially ignorant declaration about Islam.<br>If you don't want to be called on such nonsense, then you would be wise to not state such.</p><p>Why don't you start with this as an example of where Islam has been and where it is going.<br><a href=\"http://www.politicalislam.com/jihad-vs-crusades/\" rel=\"nofollow\">http://www.politicalislam.com/...</a></p><p>After that, read to koran.<br>Better yet watch the other videos on that site.</p>", "size": 0}], "name": "<p>You seem to be arguing in your own world, but that would make sense if you're name's \"Attila\"   I guess your point is that Islam is extremist, period.  I'm more interested in understanding situations, where they came from and where they are going.  You're approach appears to be simply name calling.  It doesn't further understanding.</p>", "size": 0}], "name": "<p>You need to study some history.<br>Go back over the last 1500 years</p><p>Islam has always been an \" extremist religious movement\"<br>It's been that from the get-go.</p>", "size": 0}], "name": "<p>I'm not blaming the west, I'm talking about facts on the ground.  The West has been a dominant power since about the eighteenth century.  For these last three hundred years Islam has not fared well.  As a response to this you have extremist religious movements.</p>", "size": 0}], "name": "<p>Oh YAWN !</p><p>Another \"blame the West\" idiot.</p><p>Wahabism has been around for a while, and is not the result of <br>\"Western power\"</p>", "size": 0}], "name": "<p>I don't see Wahhabism or Isis as anything but Arab responses to Western power.  First you need a crisis in order to get a response, and the rise of the West and it's imposition on the Middle East creates the crisis.  In order to impose Western forms of government and industrial systems on the Middle East, you need dictators that stifle sectarian differences.  When the lid comes off the pot the steam escapes.</p>", "size": 0}], "name": "<p>Bush and Cheney uncovered what was coming and sped up the arrival, but the underlying horror of ISIS was always there and many independent actors have been working to bring this to fruition.  Don't deny Middle Eastern peoples their agency in what has happened.</p>", "size": 0}], "name": "<p>Bush and Cheney are the main reason that Isis exists.  They didn't have to invade Iraq, because that is what destabilized it and allowed Isis to form out of a power vacuum.</p>", "size": 10}, {"author": "charlesjustice", "children": [{"author": "carlosperdue", "children": [], "name": "<p>What's the point, since you lash out at anything you're too dumb to understand or dispute anyway.</p>", "size": 0}], "name": "<p>Thanks for keeping it short this time.</p>", "size": 0}], "name": "<p>Eat me. I notice that you're unable to deal with a single point, boy.</p>", "size": 6}], "name": "<p>Boy, talk about  a negative correlation between number of words and common sense.</p>", "size": 5}, {"author": "independence01776", "children": [{"author": "carlosperdue", "children": [], "name": "<p>\"If the West is truly the promised land than it's culture and ethics will 'eventually' devour the other promises made from the many thousands of religious and cultural traditions that exist and as of yet may arise.\"</p><p>Not if the West is overrun and culturally terraformed. See the Islamic world, which was conquered by the sword. Except for temporary prosperity due to the theft of wealth and use of the superior culture of second class conquered citizens before the suppression of their culture, and except for pure luck (the oil money and the stupidity of the west in giving it to them), Islam has been constantly sliding into darkness even though Western culture is available to it. Once Islam gets control of the West, there could be 1000 generations of oppression and darkness before the \"naturally\" superior western culture reemerges.</p>", "size": 0}], "name": "<p>Nice discussion.  But probably more important than borders and defense is moral victory.  If the West is truly the promised land than it's culture and ethics will \"eventually\" devour the other promises made from the many thousands of religious and cultural traditions that exist and as of yet may arise.  <br>Well I'm not waiting for this to happen in my lifetime, it certainly is a view of history and religion that's the most logical.  The ISIS view that some \"Men\" are more adept at interpreting god's wishes (such as the men of ISIS) reflects the ego of men, and in most religions clearly spell out such thoughts are self defeating.  The methods and mentality of ISIS clearly point to this as well.</p>", "size": 0}, {"author": "chokingkojak", "children": [{"author": "carlosperdue", "children": [{"author": "chokingkojak", "children": [{"author": "carlosperdue", "children": [{"author": "chokingkojak", "children": [{"author": "carlosperdue", "children": [{"author": "chokingkojak", "children": [{"author": "carlosperdue", "children": [{"author": "chokingkojak", "children": [{"author": "carlosperdue", "children": [{"author": "chokingkojak", "children": [{"author": "carlosperdue", "children": [{"author": "chokingkojak", "children": [], "name": "<p>Mad bro mad lol ^</p>", "size": 0}], "name": "<p>Did ur mommy bake a pussc pot retard bro lol?</p>", "size": 0}], "name": "<p>All mad cuz I called it lol.  U mad bro?</p>", "size": 0}], "name": "<p>Yeah. Actually cuz ur a pussc, 2 weak minded &amp; Igbo to address  issues like a man lol <br>ur arguments r losers so u ankle-snip like a poodle lol<br>And ur busy choking on 'kojaks' lol<br>lol<br>Is that what they taut u at ur 1st rate U lol?<br>ha ha hahahahahaha lol<br>r u bi-winning lol?<br>LOL lol!</p>", "size": 0}], "name": "<p>Why not?  I know why:  'cuz speedy, 'cuz ADD, 'cuz third rate purdue  lol.</p>", "size": 0}], "name": "<p>Why not?</p>", "size": 0}], "name": "<p>Lol --  Mr. ADD or should I call you \"Speedy\" Gonzales, sport?  And how's that third-rate \"U\" called Perdue?  Why write so much for free, Spee-dee lol? </p>", "size": 0}], "name": "<p>Why should I answer your questions, dilldoe? Did you answer mine?</p>", "size": 0}], "name": "<p>Lol --You didn't answer my question:  Why write so much for free, Mr. ADD?</p>", "size": 0}], "name": "<p>Duh huh lol.  Did you have anything relevant to any issues, or are you too busy choking on your lover's \"Kojak\"? ROTFLMAO!!!</p>", "size": 0}], "name": "<p>Why write so much for free, Mr. ADD lol?  </p>", "size": 0}], "name": "<p>Did it strain your ADD attention span? LOL! Sheesh!</p>", "size": 0}], "name": "<p>You have some points dude.  But ease up on the Addie.  Sheesh lol.</p>", "size": 0}], "name": "<p>Excellent article.  But insightful and informative as it is, Graeme Wood misses what should be his own primary take-home prescription.  Which puts me in mind of another excellent article, \"Early Warning: The Continuing Need for National Defense\", written by Claremont Institute President Brian Kennedy in March 2014.  At the time, Kennedy's article reminded me of an excellent March 2006 speech by scholar Bernard Lewis to AEI and then VP Cheney.  All three works are astonishing for pretty much the same reason.  March must be the month for avoiding the terror of the obvious, or the unwelcome truth.</p><p>All three see containment as essential, yet manage to ignore the most fundamental components of rational containment policy along with our most fundamental national defenses.</p><p>The most fundamental components of containment -- and our most fundamental, critical national defenses -- are, inescapably, our own borders and immigration controls - not those of Iraq or Syria.  The West's leaders have scuttled our most critical defenses in favor of culturally and nationally suicidal over-immigration policy, behind ostensible goals like \"cheap labor\" and \"multiculturalism\", and behind the covert goal of overwhelming the loyal native-born citizenry's voting control of the USA...</p><p>\"Cheap labor\" is in reality among the most expensive labor imaginable, costing society thousands of times more in pecuniary and non-pecuniary externalities than the paltry and transient wage savings pocketed by its proponents at the expense of their fellow citizens.  Indeed, to an increasing extent, imported \"laborers\" and their progeny are not labor at all, but clients of the \"government services\" state and the welfare state.  And excessive immigration, rather than yielding \"multicultural\" benefits, is trending towards cultural extermination and cultural terraforming in favor of harmful cultures and ideologies.  Most importantly, what over-immigration ensures, along the way to ensuring the destruction of the USA, is a few decades of Democratic Party hegemony, by permanently overwhelming the loyal and relatively-conservative native-born citizenry's voting control of the USA. Democrats and other advocates of open borders (RINO and neo-\"Libertarian\" collaborators) should enjoy their impending supermajority while it lasts - basically a coup d'etat without a shot fired - because it comes at a fatal cost to the USA even as they see it.</p><p>Bernard Lewis, a British Middle East expert, discussed the danger of Islam wrecking the West.  In effect he notes that if we lose, it will not be due to attack from outside, but because we accept the immigrant culture and fail to assimilate immigrants into our culture.  The glaring implication of his speech was how the west will be destroyed through immigration.  Yet Lewis never uses the word immigration.  He closes with:</p><p>\"But the idea of freedom in its Western interpretation is making headway.  It is becoming more and more understood, more and more appreciated and more and more desired.  It is perhaps in the long run our best hope, perhaps even our only hope, of surviving this developing struggle.\"</p><p>In 2015, it should be evident that this is wish-upon-a-star thinking, combined with the assumption, or hope, or conviction that we cannot or will not or should not even try to limit immigration.  Lewis makes not a single mention of our most fundamental national defenses (borders and immigration controls), and he ignores the logical conclusion that these are an indispensable core of rational containment strategy. What is the point of \"containment\" if we *import* fast-breeding Jihadis and natural Jihadi sympathizers by the millions, as if the ease or impossibility of assimilation has nothing to do with the absolute and percentage velocity and volume of immigration.</p><p>Presumably the mere mention of over-immigration as a ratcheting threat and immigration limits as a defense is declasse and verboten at the American Enterprise Institute, especially with Richard Cheney present.  Enterprise uber alles.  It appears Lewis either defers to or shares the neo-\"Libertarian\" belief that the citizenry has no moral right to limit immigration.  Open the borders to the world and hope that \"freedom\" will save us.  Just keep thinking positively and the universe will grant your wish.  Pretty grim when a policy leader as knowledgeable as Lewis can't or won't come to the logical policy indications of his own lifelong research.</p><p>Eight years later, Brian Kennedy continues the tradition:</p><p>\"We have today between five and ten million Muslims in the United States; and in surveys conducted by the Pew Research Center, 21 percent of these Muslims find suicide bombing acceptable and five percent have a favorable view of al Qaeda. That may be a low percentage, but five percent of five to ten million is a lot of people.\"</p><p>Like Lewis, not once does Kennedy ever use the word \"immigration\".  Nor does he use the words \"border\" or \"borders\".</p><p>A year later, Graeme Wood extends the tradition of ignoring the obvious prescription of returning to non-suicidal, sustainable, assimilable, beneficial immigration limits, controls, and criteria.</p><p>Are we supposed to be comforted that \"quietist Salafism offers an Islamic antidote to Baghdadi-style jihadism\"?  I don't think so.  Salafism is an extremist form of Islam that disdains cramming Islam down everyone else's throats \"for now\", but longs for the day when it's the right time to do so.  This \"antidote\" may not call for its adherents to engage in coercion, violence and intolerance, but the antidote itself is a natural breeding ground for the disease or venom itself, producing those who are not patient enough to wait for the \"true\" caliphate. This is evidenced by Mr. Baghdadi himself - the Islamic State Caliph himself - being a *non-quietist* Salafi. If Salafism is such a safe antidote, how did that happen?</p><p>And why do we need to inundate the West with this \"antidote\"?  We don't.  To the extent that it can even be argued that we do, it's due to the suicidal  over-immigration policy inflicted on the West by neo-\"Libertarians\", the Chamber of Commerce crowd, the Democratic Party and corrupt foolish collaborators in the Republican Party.</p><p>Suppose a group of businessmen imported an extremely obnoxious harmful species for some transient perceived self-serving benefit, at the fatal expense of the native species. Rather than admit the error or back off the betrayal when the damage becomes blatant - rather than inconvenience their personal interests by allowing more sensible loyal Americans to halt and reverse the importation - they want us to import even more of a somewhat less immediately and obviously harmful species, to eat or absorb the first harmful species faster than the second species itself outbreeds and destroys the native species.</p><p>We don't need to import more of the disease, or the venom, or the \"antidote\". To the extent that Salafism is an antidote, it's an antidote that is sorely needed in Islamic countries.  It would only be needed here if our leaders insist on continuing to subvert our society by importing the disease and its carriers and vectors by the millions. To the extent that we import either moderate or \"antidote\" Muslims, it facilitates the continued extremism to flourish abroad. The moderates and the \"antidotes\" need to stay and fix their own countries. To the extent we import \"moderate\" or \"antidote\" Muslims in large numbers, it reduces the pressure and power to moderate the Islamic world.</p><p>Fundamentalist Islam must be contained in Islamic countries before it gets here in the first place. Any \"containment\" strategy that doesn't recognize that fact is wishful and delusional, risking all for the sake of PC, self-serving, anti-national, anti-USA, open-immigration theories that anyone with a modicum of sense should be able to see as empirically discredited. The easy way to do that containment without getting into the distasteful, difficult and unnecessary job of limiting immigration by religion is to return *total* immigration flow to the kind of pleasant, beneficial, assimilable, non-suicidal overall percentage flows that prevailed in the four decades or so leading up to 1961. And prioritize the minimal remaining flow to countries that are not major breeding grounds of terrorism and intolerance (unfortunately, that may soon include Europe, due to the advanced suicidal stupidity of European immigration policy).  The overall flow would be far too high even it were all from non-Islamic regions anyway.</p><p>Intolerance of intolerance is no vice. Tolerance of intolerance is no virtue. Especially when it's culturally suicidal and delusional.</p><p>Fundamentally, the greatest enemy of the USA is not imported Islamofascism, but homegrown neo-\"Libertarianism\" (as opposed to true or paleo Libertarianism). Neo-\"Libertarians\" believe that any numerical limit on legal or illegal immigration is immoral, which means they are subversive to the meaning and value of citizenship and morally opposed to the existence of sovereign countries, which means they are morally opposed to the continued existence of the USA as an independent constitutional Republic controlled by its citizens. Without numerical limits on immigration, the USA would quickly become owned and controlled by the world. Everyone in the world would effectively be an \"undocumented citizen\". Imagine that, in a world of 7.5 billion growing rapidly to twice that number, any of whom could decide to make it official at any time in the neo-\"Libertarian\" paradise of unlimited immigration. Imagine a USA sardine-canning and rat-racing from 300 million to a Darwinian 3 billion. Even if none of the 3 billion were Islamists... For those promoting this, from whatever motive - whether it's gaining political control without the bother of having to convince your fellow citizens, or the myopic greed of trying to hire imports for $1 an hour less than it would cost to hire 100 million unemployed and underemployed Americans - is it really worth it? Are you sure? Because once it's done you can never take it back.</p>", "size": 16}, {"author": "disqus_e8WE4XS05J", "children": [], "name": "<p>good standard of journalism</p>", "size": 7}, {"author": "West_Coast_Polack", "children": [], "name": "<p>I couldn't agree more — thorough, well thought-out, well-reasoned, well-sourced.  Nice job ...</p>", "size": 2}, {"author": "disqus_19LOvVhk9g", "children": [], "name": "<p>Agreed Curious, a rare gift from David Wood.  <br>Rare in that it is unusual for a reporter not to confabulate the story with denial-of-meaning.  <br>Potentially, much can be learned about the hidden agenda of Islam from David's outstandingly honest-minded research.</p>", "size": 1}, {"author": "disqus_1ikVWuchWb", "children": [], "name": "<p>What ISIS really wants is Hillary Clinton running US foreign policy again.  I wonder how much ISIS blood money made it's way into Hillary's piggy bank.</p>", "size": 0}, {"author": "ArthurVandelay", "children": [], "name": "<p>I concur with Curious George. The level of detail is outstanding. There are readers out there who want more than a superficial understanding of these issues and this article gives us a lot to think about.</p>", "size": 0}], "name": "<p>Thank you.</p><p>This is an excellent, thorough, thoughtful, and extremely well reported piece.</p><p>While I anticipate that this will not be well received by the Atlantic blog readership who is never happy when anything contradicts their egalitarian precepts, it's important for us to understand the reality on the ground.</p><p>Best thing I've read on this site in at least a year.</p>", "size": 660}, {"author": "disqus_dHN91jfQC0", "children": [{"author": "teapartydoc", "children": [], "name": "<p>Churchill offered his people nothing but \"blood, toil, tears and sweat\", and it did more to get them through the Blitz than any \"I think it is peace in our time\" twaddle.</p>", "size": 11}, {"author": "jerome_ogden", "children": [{"author": "atejas", "children": [], "name": "<p>Ah, but then what happens to the Syrian refugee crisis? 3 million and counting, and I doubt the NATO nations that would back such a plan would be welcoming them to their doors.</p>", "size": 1}], "name": "<p>I agree. Wood’s analysis of the apocalyptic catechism of ISIS is trenchant and accurate.  It makes you wonder why our strategy is the exact opposite of what it should be. It should be containment, not annihilation.</p><p>We should seek to contain ISIS to its desert caliphate, not destroy it and let all those fanatic cockroaches scatter into the rest of the world. We should allow it to exist as a magnet for all the jihadists who want “struggle, danger and death.” We should turn a blind eye as they migrate away from Europe, the US and the ME and into the caliphate, and then seal the borders tight to keep them from getting out again.</p><p>“Containment” emerged victorious against the USSR and its communist doctrine of  global conquest. It could be equally effective against the ISIS fanatics now spread throughout the world in scabrous blisters that can erupt at any time. Let them all<br>concentrate in the Iraqi desert and behead, crucify and immolate each other, not us.</p>", "size": 10}, {"author": "disqus_ipVhLJsZVB", "children": [{"author": "CuriousGeorgeOrwell", "children": [{"author": "disqus_ipVhLJsZVB", "children": [{"author": "teapartydoc", "children": [], "name": "<p>We are the biggest producer of energy in the world, they have nothing we covet.</p>", "size": 29}, {"author": "toasttoyou", "children": [{"author": "disqus_ipVhLJsZVB", "children": [{"author": "potsmaster", "children": [{"author": "disqus_Gzr5CKaBJd", "children": [], "name": "<p>It is amazing to me that when I search for the word 'Saddam' on this whole page - article and comments - your comment is the only mention of it at all! The author of the article has done a tremendous job no doubt but why no mention of how the the US deposing Saddam and giving power to Shias is what is the immediate cause of the rise of ISIS? This omission does hurt his credibility. There is ground support among other local Sunni Arabs (not just Salafis) for ISIS as well. I think this other article is doing a somewhat better job clarifying this: <a href=\"http://www.theatlantic.com/international/archive/2015/02/on-the-impossibility-of-fighting-isis/385530/\" rel=\"nofollow\">http://www.theatlantic.com/int...</a></p>", "size": 0}], "name": "<p>Actually, no. If you look at historical data, Syria has always been around 30 - 40th in oil production worldwide. Data is a nice thing to have.</p><p><a href=\"http://www.eia.gov/countries/country-data.cfm?fips=sy\" rel=\"nofollow\">http://www.eia.gov/countries/c...</a></p><p>While I get your sentiment, it is totally misplaced. The current conflict against radical, violent Islamicists, most notably ISIS, has very little to do with resources and more to do with human rights, the state system, and a much larger social conflict: Western liberal ideals, secularism, global capitalism, and modernization versus regional social customs, religious identity, local economies, and social conservatism. You can see a lot of this conflict in American society, but luckily we have a relatively stable rule-of-law in this country. Iraq and Syria had similar stability under autocratic rulers, but when those rulers were removed or their strength was threatened, violent opportunist actors filled the vacuum. If we, the United States, should be ashamed of anything it should be creating the conditions for IS to arise, namely completely disrupting Iraqi society and the local balance of power by deposing Saddam Hussein for no good reason and then mucking up the entire process of rebuilding the Iraqi state in the aftermath.</p>", "size": 21}, {"author": "CuriousGeorgeOrwell", "children": [], "name": "<p>1. Syria barely has any oil<br>2. We're producing more oil than we ever have historically<br>3. Production of gas has decreased our oil needs<br>4. Saudi Arabia will sell us cheaply whatever extra oil we need, not that we need it</p>", "size": 17}], "name": "<p>Only because Syria is all but reduced to rubble, making your argument irrelevant.</p><p>And Iraq is sitting on top of the world's second largest oilfield but they're only producing 3% of the world's oil at present, also due to devastated infrastructure. If we can't pacify both Syria and Iraq, we have no hope of controlling Iraq's oil.  I'm guessing a warmonger like you knows that.</p><p>Control of resources is our only concern when we spend trillions on war, but that doesn't play well to the masses. So, we always need a boogy man to stir the self-rightious to support war. Communists in Viet Nam. Guerrillas in Latin America. Radical muslims in the Mid East. It's a deadly global monopoly game for resources, and we're playing the long game.</p>", "size": 4}], "name": "<p>Syria is number 30 in the list of oil-producing countries, hence refuting your entire argument.</p>", "size": 12}, {"author": "jayeellis", "children": [], "name": "<p>Please go march in solidarity with the worst 8th Century Islamic savages - try to show them your sincerity about how much you hate America and that those who oppose the likes of ISIS are just racists, Islamaphobes. Try to convince them that you and gays, progressives are on their side and you.... \"share their pain\". then....</p><p>Experience some intense pain as these 8th Century Islamic savages cut your throat.</p><p>May you soon experience the life of slavery as an infidel.</p>", "size": 3}], "name": "<p>Yet you can't refute a single word.</p>", "size": 4}, {"author": "roberthenryeller", "children": [{"author": "CuriousGeorgeOrwell", "children": [{"author": "roberthenryeller", "children": [], "name": "<p>I brought up oil to counter what Robin said, which prompted your own reply. Oil may be \"substantively\" irrelevant and off topic, but not if people believe that \"controlling\" oil in the Middle East and elsewhere is an issue. And I think that many people believe that \"controlling\" oil is an issue.</p><p>To say that high oil prices are better for the US is a simplistic view, certainly that it would be better because oil would be more profitable. You seem to forget that one person's profits are another person's expenses. Unless you own oil equity.</p><p>It also wasn't 1985 in 2003, when Bush, Cheney &amp; Co. claimed that Iraqi oil would pay for our invasion and occupation of Iraq.</p><p>Further, try telling people in Western Europe, or Eastern Europe, for that matter, that prices for Russian gas and oil, or even the availability of that gas and oil, are irrelevant.</p><p>Finally, you seem to dismiss the fact that the prices everyone in the world have to pay for energy affect us in the US, regardless of our parochial energy situation. But money that people everywhere have to pay for energy is money they can't spend on other things, like imported goods. It will also affect what they can produce in their own countries.</p>", "size": 0}], "name": "<p>This is irrelevant and off topic.</p><p>The  US is resource rich, particularly in regards to energy.  And Saudi Arabia is a close ally that has the potential to meet any unmet needs.</p><p>What's happening in Iraq, Iran, Venezuela, Russia, or Libya is of marginal importance in terms of energy needs and policy.</p><p>In fact, if those countries are destabilized and a mess it's better for our energy industry because prices are driven up and a high price point is needed to make extracting oil in North America, which is more labor intensive, profitable.</p><p>We don't \"want their oil.\"  Enough of that insipid liberal truism.  It's 2015, not 1985.</p>", "size": 2}], "name": "<p>I would like to see a well reasoned and evidenced debate on whether we (Americans in particular, Westerners in general) would be better off remaining simply consumers and clients of energy resources located in countries we do not attempt to control, or if using military means to control or try to control energy resources in other countries is actually to our benefit.</p><p>My own current \"point of departure\" is that we'd be better off simply as consumers and clients. I base this position largely on an argument made Terry Tamminen, and referenced by Robert F. Kennedy Junior, that we subsidize the U.S. oil industry at a rate of $10 per gallon of gasoline when all costs, including military subsidies we pay through our taxes, are factored in.</p><p><a href=\"http://www.rollingstone.com/politics/news/robert-f-kennedy-jr-on-the-climate-crisis-what-must-be-done-20070628\" rel=\"nofollow\">http://www.rollingstone.com/po...</a></p><p>On the other hand, we do see that Western Europe may be blackmailed with energy supplies and prices by Russia.</p><p>So, when talking about the costs of energy, we need to talk about political and strategic as well as economic and financial costs of energy.</p><p>But I do suspect that, as is often the case, what is good for corporations and what is good for countries and citizens are interests which may, and often do, diverge.</p>", "size": 1}], "name": "<p>Worst comment on the thread</p>", "size": 53}, {"author": "SMRangersFan", "children": [], "name": "<p>Typical liberal response - its all about oil, we are the problem, we deserve it.</p><p>Do they hold any responsibility or is it all our fault?</p>", "size": 9}, {"author": "awenshok", "children": [], "name": "<p>Stupidity is a heavy burden.</p>", "size": 7}, {"author": "jayeellis", "children": [], "name": "<p>Oh do shut up.</p><p>Did you read this honest article? These 8th century Islamic savages have brought back slavery, crucifixion, they are making none official Islamists pay a \"unbeliever\" tax.</p><p>And you're still pushing the ridiculous Hollywood Leftist lie that all the problems in Iraq, the world are caused by evil White American Conservatives trying to steal oil.</p><p>We now have lots and lots of oil in North Dakota. It ain't all about \"oil\" and there is simply no F*($*%)(#@ way you are going to make alliance between Michael Moore Hollywood Left and ISIS.</p><p>Yeah, go ahead shout \"RACIST\" - why not go shout this with your friends in ISIS in Iraq only you probably won't get to shout very long as soon your head will be cut off and put on a pike.</p><p>Take a hike!</p>", "size": 6}], "name": "<p>By sheer coincidence, we only see ISIS as a significant threat in countries with resources we covet, and they're the biggest threat where those resources are up for grabs like Syria and Iraq. Or did you think we'd be invading and bombing Saudi Arabia, home of the 9/11 hijackers and current weekly beheaders anytime soon?</p><p>Please wake up America. How many times have we heard \"we must kill the savages\" used to justify perpetual, hugely profitable war?</p>", "size": 8}], "name": "<p>Superb article, thank you. Terrifying, but superb. The Orwell quote at the end makes clear why this group will be so hard to defeat.</p>", "size": 165}, {"author": "disqus_0fA8jI31wR", "children": [{"author": "CuriousGeorgeOrwell", "children": [{"author": "Anonymous", "children": [{"author": "thewetone", "children": [{"author": "disqus_CmsyeK4TO1", "children": [{"author": "Anonymous", "children": [{"author": "disqus_CmsyeK4TO1", "children": [], "name": "<p>I know we do. Wasn't trying to say that we don't. The example that came to my mind was dropping the atomic bombs and killing civilians during World War 2.</p>", "size": 0}], "name": "<p>We do the same thing. Remember \"shock and awe\"?</p>", "size": 5}], "name": "<p>They specifically state in the article that the Terrorism brought on by beheadings and enslavement is meant to avoid prolonged war.</p><p>\"He told me the state has an obligation to terrorize its enemies—a holy order to scare the shit out of them with beheadings and crucifixions and enslavement of women and children, because doing so hastens victory and avoids prolonged conflict.\"</p>", "size": 4}, {"author": "Anonymous", "children": [], "name": "<p>tomato tomatoe. radical islamic violence.</p>", "size": 2}], "name": "<p>I don't think that ISIS is, given what is written here, an example of Islamic terrorism. This is more like a religious revival of some hellish sort.</p><p>Terror is a tactic. They're not engaging in tactical behaviour, it's more like prosyletizing, if I've understood the article correctly.</p><p>Which is even more disturbing than this being an example of Islamic terrorism to be honest.  It's even nuttier and less savoury than Osama Bin Laden (there's a phrase I never thought I'd write in my life, but there it is. What a world we live in).</p>", "size": 15}], "name": "<p>one of the few mainstream articles on Islamic terrorism that i actually liked. Treated the actors sincerely, addressed the moderate != non/anti violent problem and pointed to the obvious fact that people with \"standing\" to make criticism are the ones who actually matter.</p><p>and that's ignoring the fact he actually did, you know, solid reporting instead of merely pontificating based on priors.</p>", "size": 49}, {"author": "disqus_KIS55WcSeC", "children": [{"author": "sweetjazz3", "children": [{"author": "disqus_KIS55WcSeC", "children": [], "name": "<p>I hope so.</p>", "size": 0}], "name": "<p>I don't see people finding this an example of Islamophobia.  It is a nuanced piece that outlines the very real, very Islamic origins of Daesh, illustrates why very few Muslims accept their interpretation and highlights the limits of what American intervention can achieve.</p><p>Much of the concern over Islamophobia has nothing to do with acknowledging that Daesh is motivated by Islam.  To deny that is the height of absurdity (the word 'Islam' is in their official title for goodness sake!).  All Daesh members are Muslim is absolutely true (apostasy being punished by a death sentence has a purifying effect!), but the converse statement is not.  Indeed, the vast majority of Muslims reject Daesh overall, though, as the article indicates, they often agree on some aspects of Islamic faith.</p><p>Daesh desperately wants to create a holy war between Muslims and the West.  That is their only hope to convince a broader swath of Muslims that Daesh is a necessary alternative to prevent the annihilation of Muslims by the West.  If the West conflates Daesh with the broader Muslim world, we will be doing exactly what Daesh is hoping for.</p>", "size": 42}, {"author": "veerkg_23", "children": [{"author": "1Pokey4", "children": [], "name": "<p>The weak minded also tend to call for a war on Islam in its entirety.</p>", "size": 6}], "name": "<p>Actually the weak minded often cloak themselves in patriotism and religion. It's a sign of a failed argument, and they should be called out for it.</p>", "size": 8}, {"author": "CuriousGeorgeOrwell", "children": [{"author": "disqus_KIS55WcSeC", "children": [{"author": "CuriousGeorgeOrwell", "children": [{"author": "azt24", "children": [{"author": "1Pokey4", "children": [], "name": "<p>Frum's piece was tripe.</p>", "size": 3}], "name": "<p>You are hearing the shift from European leaders this week. Not from Obama, though. As David Frum points out in a good piece today, Obama can freely say \"terrible deeds in the name of Christ\" but he NEVER says \"terrible deeds in the name of Allah\" or \"Islam\". Anytime you expect to hear \"Islam\" Obama says \"religion\" instead.</p><p>That's because Obama is trying to ally with the Islamists -- the ones he imagines are moderate -- Muslim Brotherhood, AKP, Khamenei in Iran. But those pesky ISIS enthusiasts keep getting in the way with their videos. But Obama tries to ignore them.</p>", "size": 4}, {"author": "crassyknoll", "children": [], "name": "<p>The orange jumpsuits for all their snuff video victims is clearly a reference to Gitmo.</p><p>Also clearly indicating that the Great Satan is living rent free in their collective heads 24/7.</p>", "size": 4}, {"author": "disqus_KIS55WcSeC", "children": [], "name": "<p>Nailed it.</p>", "size": 3}], "name": "<p>Agreed.  At some point you have to listen to what people are actually saying instead of just projecting on them what you'd like to believe.</p>", "size": 13}], "name": "<p>People like this always say what they want and why, but the West in general really doesn't believe it and wants to \"discuss\" how people feel.  The world is beginning to wake up though, especially the Middle East.</p>", "size": 4}], "name": "<p>Agreed on the Islamophobia bit.</p><p>I do think it's interesting that we haven't put much effort into understanding their ideology.  With their murder porn for example, we concentrate on the gory violence but miss the narrative.  Which is usually what happens, but in this case it's worth following the story.</p><p>Fascinating piece.</p>", "size": 5}], "name": "<p>Apologists will look askance and declare it a clear example of islamophobia.  What's so painfully ironic is that we don't need to wonder what ISIS wants.  They will tell us exactly what they want and what they are willing to do to achieve their goals.  They aren't exactly shy about it.  However, the weak minded will continue to believe \"that's not what they really meant\"...</p>", "size": 47}, {"author": "1Pokey4", "children": [], "name": "<p>Agreed. It certainly adds an awful lot of nuance to the debate.</p>", "size": 1}, {"author": "jayeellis", "children": [{"author": "CuriousGeorgeOrwell", "children": [], "name": "<p>:)</p>", "size": 0}], "name": "<p>Or maybe a career ender.</p><p>Google what happened to John Derbyshire when he wrote some unpleasant truths.</p>", "size": 0}], "name": "<p>Fantastic piece. Hopefully this guy gets lots of attention for it.</p><p>Looks like this may be a career-maker for him.</p>", "size": 41}, {"author": "Arcite", "children": [], "name": "<p>I am impressed. Much better than the majority of 'blog-like' posts, complete with spelling errors that have become the usual.</p>", "size": 9}], "name": "<p>Sort of reminds me of a old Atlantic Monthly magazine article.  Well done.</p>", "size": 118}, {"author": "PeterJakes", "children": [{"author": "JohnathanA", "children": [{"author": "PeterJakes", "children": [{"author": "JohnathanA", "children": [{"author": "johnspragge", "children": [{"author": "azt24", "children": [{"author": "johnspragge", "children": [{"author": "azt24", "children": [{"author": "johnspragge", "children": [], "name": "<p>At least some social psychology suggests that social pressure has an effect, even on people who consciously reject it.</p>", "size": 0}], "name": "<p>\"Human nature has a strong social component; when 99% of your fellows disagree with you, it has an effect.\"</p><p>Not when you think like Da'esh. They think Allah has given them a license to kill until those around them accept their ideas.</p><p>So we will either hear silence from the moderates, or gunfire. There is nothing in-between. You cannot argue with Da'esh.</p>", "size": 0}, {"author": "disqus_UGk5CMtpm7", "children": [{"author": "disqus_ZqajzkI53H", "children": [], "name": "<p>Ah fighting them? Ignoramus </p>", "size": 0}], "name": "<p>Where is the anti ISIS militia? Words are cheap.</p>", "size": 0}], "name": "<p>The statement I answered had nothing to do with whether or not the opposition of the overwhelming majority of the world's Muslims will have an effect on the thinking of members of the Daesh. I suspect it may have an effect, whatever theological claims leaders of the Daesh make. Human nature has a strong social component; when 99% of your fellows disagree with you, it has an effect.</p><p>But I didn't say that. I answered the argument by \"JohnathanA\", when he said, above:</p><blockquote>Their silence is deafening.</blockquote><p>That statement my cites and the many more avaiable refute. Whatever effect the words of Muslims who oppose the Daesh may or may not have, they have in fact spoken up.</p>", "size": 4}], "name": "<p>But differing Muslims will be declared takfir if they differ within earshot of ISIS.</p>", "size": 6}, {"author": "disqus_UGk5CMtpm7", "children": [{"author": "johnspragge", "children": [], "name": "<p>Western volunteers have gone to fight with the Peshmerga against the Daesh. Western governments, not least the Americans, have unequivocally insisted the Kurds send them home. Western policy makers do not want their work complicated by any more hostages. If Western Muslims did what you suggest, evidence strongly suggests the American government would not welcome their efforts.</p><p>Get back under your bridge.</p><p>Fee fie foe foo</p>", "size": 1}], "name": "<p>Moderate Muslims should be flocking to Iraq / Syria to take back their faith from ISIS,but they are to moderate in their opposition of ISIS to get off their butts. They would rather sit at home and complain about somebody spray painting a mosque. Let Americans go to fight and then complain we are Crusaders. Arrogant matyrs.</p>", "size": 3}], "name": "<p>I have said this before... <a href=\"http://www.beliefnet.com/columnists/commonwordcommonlord/2014/08/think-muslims-havent-condemned-isis-think-again.html\" rel=\"nofollow\">if,</a> <a href=\"http://www.globalresearch.ca/muslim-leaders-worldwide-condemn-isis/5397364\" rel=\"nofollow\">as</a> <a href=\"http://rt.com/news/229383-kasasbeh-reaction-isis-crucify/\" rel=\"nofollow\">this</a> <a href=\"http://www.dailymail.co.uk/news/article-2939536/Even-Al-Qaeda-condemn-murder-Jordanian-pilot-deviant-leading-Muslim-cleric-calls-ISIS-militants-killed-crucified-limbs-chopped.html\" rel=\"nofollow\">article</a> <a href=\"http://www.cbc.ca/news/canada/manitoba/manitoba-muslims-condemn-isis-video-from-ottawa-man-1.2864344\" rel=\"nofollow\">claims,</a> <a href=\"http://www.patheos.com/blogs/deaconsbench/2014/08/the-muslims-who-are-condemning-isis/\" rel=\"nofollow\">a case</a> <a href=\"http://en.radiovaticana.va/news/2014/07/25/worlds_muslim_leaders_condemn_attacks_on_iraqi_christians/1103410\" rel=\"nofollow\">can</a> <a href=\"http://www.commondreams.org/news/2014/09/25/muslims-and-scholars-condemn-isis-betraying-religion-mercy-and-compassion\" rel=\"nofollow\">be</a> <a href=\"http://www.businessinsider.com/muslims-using-sharia-law-against-isis-2014-10\" rel=\"nofollow\">made</a> <a href=\"http://www.breitbart.com/national-security/2015/02/05/history-of-islamic-punishment-belies-condemnation-of-isis-burning-by-muslim-clerics/\" rel=\"nofollow\">for</a> <a href=\"http://www.independent.co.uk/news/uk/crime/isis-concern-british-muslim-leaders-condemn-extremist-group-9599273.html\" rel=\"nofollow\">the</a> <a href=\"http://www.bbc.com/news/uk-28270296\" rel=\"nofollow\">religious</a> arguments behind the behaviour of the Daesh, a great many Muslims do <em>not</em> accept those arguments, and have said so publically, repeatedly, and with emphasis. To claim that Muslims have remained silent grossly distorts the record.</p>", "size": 31}, {"author": "veryextremelytrue", "children": [{"author": "JohnathanA", "children": [], "name": "<p>You need to address the Muslim lack of action against Muslim  terrorism before whining to me about it.</p>", "size": 1}], "name": "<p>I agree. All Muslims should be responsible to talk about ISIS all the time forever and ever. They don't have any other concerns.</p><p>FWIW I blame you for everything your President Obama has ever done.</p>", "size": 5}, {"author": "disqus_KIS55WcSeC", "children": [], "name": "<p>Because in Islam, any message against the bullies is dealt with explosive brutally.</p>", "size": 2}, {"author": "disqus_5qzqOx9kvO", "children": [{"author": "JohnathanA", "children": [{"author": "disqus_5qzqOx9kvO", "children": [{"author": "JohnathanA", "children": [{"author": "disqus_5qzqOx9kvO", "children": [{"author": "JohnathanA", "children": [{"author": "disqus_5qzqOx9kvO", "children": [{"author": "JohnathanA", "children": [{"author": "disqus_5qzqOx9kvO", "children": [{"author": "JohnathanA", "children": [{"author": "disqus_5qzqOx9kvO", "children": [], "name": "<p>No, he just popped by for a few tinnies and a whine.</p>", "size": 0}], "name": "<p>You asked God, did you?</p>", "size": 0}], "name": "<p>Not even God understands what you're babbling on about.</p>", "size": 0}], "name": "<p>You do not have the intellect to read and comprehend my comments,  evidently. </p>", "size": 0}], "name": "<p>Don't worry, I certainly won't be looking in yours.</p>", "size": 0}], "name": "<p>You should never bow to yourself and look to others for intelligence.</p>", "size": 0}], "name": "<p>But every nown again I condescend to idiots.</p>", "size": 0}, {"author": "disqus_5qzqOx9kvO", "children": [], "name": "<p>But every nown again I make an exception and condescend to morons.</p>", "size": 0}], "name": "<p>So your madrassa only taught you how to insult those people smarter than you. </p>", "size": 0}], "name": "<p>Speaky the English?</p>", "size": 0}], "name": "<p>So your name is really a med. </p>", "size": 0}], "name": "<p>I think they're a bit busy calling round everyone else. Wait patiently by your phone, I'm sure you'll be next.</p>", "size": 0}, {"author": "disqus_NSfjU6m9DQ", "children": [{"author": "JohnathanA", "children": [], "name": "<p>So clean your ears out!</p>", "size": 0}], "name": "<p>Only to the deaf.</p>", "size": 0}], "name": "<p>Their silence is deafening.</p>", "size": 52}, {"author": "disqus_4iScQ2WAJ3", "children": [{"author": "PeterJakes", "children": [], "name": "<p>Or a friend might have said that his parents left Pakistan since it was \"a wretched, poverty stricken place\" and that they wanted to raise their children in a \"prosperous, open society\". Of course he could have been lying but I don't think he was and I think that attitude is more common than ISIS might think. Which will be their downfall eventually. Terror and hatred are slim reeds upon which to build a future.</p>", "size": 12}, {"author": "disqus_FmRRDyYPsJ", "children": [], "name": "<p>Thought crime! How lovely.</p>", "size": 3}], "name": "<p><i>I see them everyday here in Toronto</i></p><p>Unless you're a mind reader you have no idea what they really believe.</p>", "size": 14}, {"author": "Opinion39", "children": [], "name": "<p>There are plenty of decent muslims in Toronto, yes, but there are also the \"peaceful\" freedom-loving Canadian democracy-supporting Toronto muslims like these (yes, sarcasm).</p><p><a href=\"http://news.nationalpost.com/2012/09/18/muslim-congress-blasts-zionist-and-islamophobic-hate-mongers-in-call-for-toronto-protest-against-film/\" rel=\"nofollow\">http://news.nationalpost.com/2...</a></p><p><a href=\"http://www.jewishtribune.ca/news/2012/09/25/protests-wont-stop-till-islam-rules-world-speaker-claims\" rel=\"nofollow\">http://www.jewishtribune.ca/ne...</a></p><p>Or the ones that protested week after week and closed down the main highway: <a href=\"http://www.tamilguardian.com/article.asp?articleid=11348\" rel=\"nofollow\">http://www.tamilguardian.com/a...</a></p>", "size": 5}, {"author": "Anonymous", "children": [{"author": "azt24", "children": [], "name": "<p>Al Sisi is trying...</p>", "size": 4}], "name": "<p>why? Why not those who:</p><p>sincerely understand Jihad includes personal and societal struggles and are motivated by a percieved injustice in the diminsted state of the islamic world</p><p>those who, like most people who are not WEIRD don't actually support expanded gay rights or feminism</p><p>those who believe in an ideal society where islam is front and center while not placing undue burdens on people of other faiths and protecting their persons,</p><p>those who think ISIS and Al Quaeda are cancers</p><p>these are the people who will defeat the Islamic state and advance a better status quo for Muslim countries. These are people with internal societal capital who people are forced to listen to.</p><p>as mark Lilla noted <br><a href=\"http://www.newrepublic.com/article/118043/our-libertarian-age-dogma-democracy-dogma-decline\" rel=\"nofollow\">http://www.newrepublic.com/art...</a></p><p>The next Nobel Peace Prize should not go to a human rights activist or <br>an NGO founder. It should go to the thinker or leader who develops a <br>model of constitutional theocracy giving Muslim countries a coherent way<br> of recognizing yet limiting the authority of religious law and making <br>it compatible with good governance. This would be a historic, though not<br> necessarily democratic, achievement.</p>", "size": 3}, {"author": "madihwa", "children": [{"author": "benschachar", "children": [{"author": "madihwa", "children": [], "name": "<p>In some of those countries flirting or even barely glancing at a guy riding by on a motorcycle is enough to get a girl (young teen even) killed.  These guys are really nuts.  I read about one case of an old lady who had no direct male relative left.  There were, however, some friends she had known while they were growing up.  They continued to deliver food to where she lived.  Apparently this is a no-no.  Someone found out about it.  Last I heard she was due to be whipped.  Crazy people.  Kill women one way or kill them the other.  Starve them if nothing else.  I guess when you are old and female if you have no male relative left, you're expected to stay home and starve to death some places.  Sick.</p>", "size": 0}], "name": "<p>I don't think any muslim proposes raped women be honor killed.</p><p>Except the really dumb ones...</p><p>The thing is you need 3 male witnesses or 6 female witnesses ('cause the testimony of women in Islam are only half as worthwhile as a man) or some combination that equals 3 men to prove someone is raped. The other problem is that fornication (not adultery) is an honor killing worthy offense so you have the deck stacked against women completely in court and if they can't prove their case...</p>", "size": 0}], "name": "<p>So you're saying they don't believe in honor killings if their daughter is raped, don't believe she's forever 'dirty' if she has an affair, don't think she's less important than her brothers, don't hate gay men?</p>", "size": 0}, {"author": "RileyDeWiley", "children": [], "name": "<p>Durn right! It is really not fair to judge a whole religion on the basis of a few million extremists.</p>", "size": 0}], "name": "<p>Ones who believe in a tolerant, pluralistic society. <br>Ones who do not think apostates should be killed and that infidels are inferior to believers. <br>Ones who do not believe women are inferior and homosexuals are damned. Ones who think ISIS and Salafism are cancers on their faith.<br>Ones who think that Jihad only applies to their personal struggle with their faith and not as a declaration of war on the kafirs.</p><p>There are many, many of them. I see them everyday here in Toronto and they are the ones that will be the undoing of ISIS.</p>", "size": 38}, {"author": "veerkg_23", "children": [{"author": "JohnathanA", "children": [{"author": "johnspragge", "children": [{"author": "Bobloblaw67", "children": [{"author": "po8crg", "children": [{"author": "Bill_Owen", "children": [], "name": "<p>How do you know this? </p>", "size": 0}], "name": "<p>Indeed so.  Most Americans are Christian, but their identity is American, not Christian.</p><p>It is a great strength of the Kurds that they are Muslims, but don't place that first.</p>", "size": 15}, {"author": "johnspragge", "children": [{"author": "madihwa", "children": [{"author": "johnspragge", "children": [{"author": "madihwa", "children": [], "name": "<p>Quite well explained.  Thank you.  I still don't have to like it.  Some people associate the negative aspects of THOSE parts of Asia with the rest of Asia--and I really dislike that.  Indonesia does not possess those negative aspects despite being muslim and we can all guess why that is.  That doesn't mean I approve of everything Indonesia does but it does not have honor killings, etc.</p>", "size": 0}], "name": "<p>Short answer: ancient Greek geographers. You can find a graphic depicting the modern consensus definition of Asia <a href=\"https://en.wikipedia.org/wiki/Asia#mediaviewer/File:Asia_%28orthographic_projection%29.svg\" rel=\"nofollow\">here</a>, as part of an <a href=\"https://en.wikipedia.org/wiki/Asia\" rel=\"nofollow\">article</a> that addresses the problems in definition you speak of. Obviously, any expression describing the area rougly bounded by the Red sea and Mediterranean, Black sea, Caspian Sea, and Indus River will provoke controversies. No one term exists that everyone will agree on, with the possible exception of GPS coordinates.</p><p>I would note that the Muslim populations of Pakistan, India, Bangladesh and Indonesia add up to <a href=\"https://en.wikipedia.org/wiki/Islam#Demographics\" rel=\"nofollow\">about 62%</a> of the world's Muslim population, and the geographic consensus puts all these nations in Asia.</p>", "size": 5}], "name": "<p>Whoever drew the line that made any part of the muslim world, other than Indonesia, Asia?  They don't share background, language, culture, DNA; they're not really even in the same area.  Think of China as Asia and the countries that are closest to it as Asia and the rest as the middle east.  Many of us with Asian backgrounds don't like the associations--violence, honor killings, kitchen fire killings, checking girls for hymens (disgusting!), just to name a few.</p>", "size": 1}], "name": "<p>In other contexts, this would provide a useful reminder that the tangled politics of Western Asia involve many many issues besides confessional conflicts; ethnicity, language, and all the \"national\" feelings familiar to Europeans drive politics in the Levant. But in this context, I will simply say that I have concluded that \"JohnathanA\" is a troll and I apologize for feeding him.</p>", "size": 3}, {"author": "gn8r", "children": [{"author": "RBrenizer", "children": [], "name": "<p>I think it would be the same thing to call Christians that murder others in the name of their religion \"Radical Christians\". Most of us would denounce that killers would be Christian. Muslims feel the same way. They are not Muslims according to modern Muslim theology. </p>", "size": 0}], "name": "<p>Does that mean they are not Muslim?</p>", "size": 0}], "name": "<p>Kurds are Muslim but their identity is Kurdish not Muslim </p>", "size": 10}], "name": "<p>Who do you think actually wears the boots on the ground fighting the Deash? What religion do you think the Kurds follow? What religious group does the elected government of Iraq belong to?</p>", "size": 52}, {"author": "veerkg_23", "children": [{"author": "pill_popper", "children": [], "name": "<p>And Muslims make up the majority in all conflicts. Chill!</p>", "size": 2}], "name": "<p>There are more muslims fighting ISIL than any other religious group.</p>", "size": 32}, {"author": "SgtKonus", "children": [{"author": "JohnathanA", "children": [{"author": "annthurlow", "children": [{"author": "JohnathanA", "children": [], "name": "<p>What is not?</p>", "size": 1}], "name": "<p>What, precisely, do you find so humorous about this subject?</p>", "size": 4}], "name": "<p>lol</p>", "size": 1}], "name": "<p>Yum, moving the goalposts!</p>", "size": 21}, {"author": "Bustercat", "children": [{"author": "JohnathanA", "children": [], "name": "<p>If you follow me at all instead of just wanting to insult me in the name of your moon deity,  you will note my respect for sisi and the Egyptian people.</p>", "size": 0}], "name": "<p>Egypt just launched air sorties against ISIS in the name of 21 murdered Christians in Libya. Libyan generals allowed them to bomb to as they \"have a right to avenge the blood of their children\" <br>Let me guess, some kind of elaborate islamic deception?</p>", "size": 4}], "name": "<p>Nothing you say is credible until those mythical muslims rise up and slay all those muslim militants.</p>", "size": 46}, {"author": "ggm281", "children": [], "name": "<p>And they were doing what to stop IS?? I agree, good human beings, but it isn't going to be good human beings that stop IS. Did you know that right now in Raqqa IS has a nightly curfew and you are shot for violating it?? No excuses, no questions. So one woman died in childbirth because she was shot heading to the hospital at 2 am. Another young teen was shot because he was heading to the hospital to get an inhaler for his asthmatic brother in a sandstorm. Don't know if the brother died. The teen survived his wounds, but had to drag himself to the hospital because none would come to help him.<br>Want to know why IS is doing this?? Because it is the most expedient way to stop their deserters who use the cover of night to escape to Turkey (and back to their homes from there) This is true \"religious oppression and profiling\". And while providing dental care to refugees may be a noble thought, in reality it does NOTHING to actually bring Iraqis and Syrians any sort of decent life. If it isn't Assad (a Muslim) trying to kill them, it is Shiite militias armed and funded by Iran (again a Muslim state), or it is IS recruiting the quite willing Sunni tribesmen to join them in exterminating their Shia neighbors, or even the \"lone wolf\" Sunnis who car bomb and suicide bomb Baghdad multiple times a week.  <br>My point being, Islamic extremism is not a western problem or even much of a threat. But it sure is a threat to Muslims (and non-Muslims) in the Middle East!!</p>", "size": 8}, {"author": "TimToolmanTaylor", "children": [], "name": "<p>That was a few.</p>", "size": 0}], "name": "<p>Moaz al-Kasasbeh<br>Deah Barakat<br>Yusor Abu-Salha<br>Razan Abu-Salha</p><p>to name a few...</p>", "size": 26}], "name": "<p>\"good muslims\"?</p>", "size": 42}, {"author": "disqus_cOZzOztQW6", "children": [{"author": "mtl_bcer", "children": [], "name": "<p>Well I learned something new today!</p><p>Your pseudo-pseudo-Burkean conclusion is brilliant, thanks for making my day!</p>", "size": 3}], "name": "<p>Burke never actually said that, even though it's very commonly attributed to him. The \"good men do nothing\" line was a paraphrase by a later author of something that Burke *did* say, which had a somewhat different emphasis:</p><p>\"When bad men combine, the good must associate, else they will fall one by one, unpitied sacrifices in a contemptible struggle.\"</p><p>This probably sounds pedantic, but the only thing necessary for the triumph of misquotes is for pedants to do nothing.</p>", "size": 21}, {"author": "1Pokey4", "children": [{"author": "RBrenizer", "children": [{"author": "mtl_bcer", "children": [{"author": "1Pokey4", "children": [], "name": "<p>They wouldn't have to go into Italy for that. Simply cross the border into Turkey.</p>", "size": 1}], "name": "<p>That's where NATO obligations would presumably be invoked.</p>", "size": 3}, {"author": "gn8r", "children": [{"author": "sampratt", "children": [], "name": "<p>Exactly. The isolationism of ISIS (and its focus on consolidating contiguous territory for its caliphate) is one of the many things this piece helped clear up for me.</p>", "size": 5}], "name": "<p>I would agree but only because of existing treaties, also as noted in the article, one of the main differences between Al-Qaeda and ISIS is that ISIS is focused on regional dominance rather than attacking the West, yes they are murdering hostages, but those hostages were all captured in the region, they don't seem to have the abililty or inclination to carry out attacks outside of the Middle East.</p>", "size": 1}], "name": "<p>I like what you are saying, but if they step one foot into Italy, I will take my 52 year old butt out there and kill a few myself. The U.S. can not let an attack on Europe be someone else's fight. We are all together on this one.</p>", "size": 5}], "name": "<p>A lot of Muslims are jumping into the fight. Apparently, there are Iraqui militias numbering about 100,000 men getting into it. The sticking point is that they are backed (and possibly commanded by) Iran. In my opinion, this is a positive development. But in Neo-Conlandia, iran`s participation poses an ideological and narrative threat.<br>Also, Egypt just bombed the bejeezus out of ISIS positions in Libya after the execution of 21 Christians being held hostage.<br>The U.S. cannot be the leader in this fight - that would only serve to strengthen ISIS and Al Qaeda propaganda efforts, thus attracting more followers. Besides, the muslim countries of the region have a hell of a lot more to lose than we do.</p>", "size": 11}, {"author": "ingenjren", "children": [], "name": "<p>Lame. The Kurds are kicking IS ass while you sit there armchair philosophizing.</p>", "size": 7}, {"author": "nerdrrage", "children": [], "name": "<p>I don't get why people think Muslims aren't doing anything. Look at the Kurds, they are fighting like rabid hyenas and they are Muslims! So let's give them some guns and shit. Sure, they pussyfoot around with terrorism, but not against America, and given how badly they've been treated by Turks and Arabs, it's understandable. We should cultivate their liberal and democratic tendencies but to do that, we need influence, and there's nothing better for gaining influence by giving embattled people large caliber weaponry.</p>", "size": 6}, {"author": "bram00", "children": [], "name": "<p>How about good people, period?  Whether they be Muslim, Christian or Jewish?  All need to join together to fight this plague.</p>", "size": 5}, {"author": "Ran_Min", "children": [], "name": "<p>To use an analogy here,</p><p>Is it the responsibility for African Americans to stop African American criminals, in order to counter the bias that African Americans are more likely to be criminals?</p><p>The identity of IS is a collection of mass-murderers, whether done in the name of any religion or not. It is the responsibility of every peace-loving person to stop them, regardless of religious affiliation.</p>", "size": 2}, {"author": "marik77", "children": [{"author": "johnspragge", "children": [{"author": "marik77", "children": [{"author": "disqus_cOZzOztQW6", "children": [], "name": "<p>Burke never actually said that, even though it's very commonly attributed to him. The \"good men do nothing\" line was a paraphrase by a later author of something that Burke *did* say, which had a somewhat different emphasis:</p><p>\"When bad men combine, the good must associate, else they will fall one by one, unpitied sacrifices in a contemptible struggle.\"</p>", "size": 2}], "name": "<p>I merely stated the obvious, which is, I suppose, simplistic. There are many, many people who are neither \"evil\" nor \"good.\" Mr. Burke doesn't seem to be aware of them. Not so profound, he.</p><p> </p>", "size": 1}], "name": "<p>I would say, rather, a simplistic distortion of an otherwise profound observation.</p>", "size": 2}], "name": "<p>Simplistic comment, Mr. Burke.</p>", "size": 2}, {"author": "madihwa", "children": [{"author": "nerdrrage", "children": [{"author": "madihwa", "children": [], "name": "<p>:D</p>", "size": 0}], "name": "<p>Well that's why God invented caller ID.</p>", "size": 1}], "name": "<p>When do they ever do anything--beyond occasionally talk.  I'm surprised when they do that.</p><p>Their governments are more interested in forcing people into converting.  Conversion by swordpoint.  Marry an Iranian woman and you soon get a call from Iran's government telling you, 'Hey, come back here to visit her family again without first converting and you'll be beheaded.'  Nice people.  Oh, another conversion.  At least they haven't tried to make the guy's kids convert--but then they will NEVER visit!</p>", "size": 1}, {"author": "gary_talbott", "children": [{"author": "fantasticrice", "children": [{"author": "gary_talbott", "children": [], "name": "<p>Please support your claim with facts: Instances of people murdering in the name of Jesus the way they're murdering in the name of Allah.</p>", "size": 1}, {"author": "disqus_y8MfAKXKFC", "children": [], "name": "<p>So, it's okay with you then. Let them kill,rape,rob,beat,stone,mutilate, torture, terrorize and to You it's okay because it's all been done to somebody else before? Are you serious?</p>", "size": 0}], "name": "<p>Unfortunately there has been no shortage of professing followers of the Prince of Peace who draped themselves in the violence of nationalism.</p>", "size": 3}], "name": "<p>I agree we need to hear more from moderate Muslims. But based on this article, the Islamic State represents the true \"good Muslims\" while Muslims that don't swear allegiance to the caliphate are apostates. It's really no wonder when you look at their prophet. \"All Muslims acknowledge that Muhammad’s earliest conquests were not tidy affairs, and that the laws of war passed down in the Koran and in the narrations of the Prophet’s rule were calibrated to fit a turbulent and violent time.\" I personally worship the Prince of Peace.</p>", "size": 0}, {"author": "Bill_Owen", "children": [], "name": "<p>More Muslim civvies  droned  to death then died on 911. What are you doing about that? Nothing! </p>", "size": 0}], "name": "<p>\"The only thing necessary for the triumph of evil is for good men to do nothing.\"<br>Edmund Burke</p><p>The only thing necessary for the triumph of ISIS is for good Muslims to do nothing.</p>", "size": 91}, {"author": "disqus_KIS55WcSeC", "children": [{"author": "CuriousGeorgeOrwell", "children": [], "name": "<p>Graeme Wood is fantastic.  I hope they're able to continue to support this type of work.</p>", "size": 40}, {"author": "johneurope", "children": [{"author": "Asurbanopal", "children": [{"author": "fantasticrice", "children": [], "name": "<p>Furthermore, the main reason they hate us at all rather than their former disgusted indifference, is due to our multi-decade-long, tone-deaf meddling in the region.</p>", "size": 1}], "name": "<p>'Twelvers' refers to the basic tenants of Islam practiced by most Shia Muslims. It simply means they believe in 12 divinely inspired leaders or caliphs. Its not remarkably different from Christians in their belief in apostles. 'Twelvers' is distinct from 'Fivers' which is what Sunnis typically believe - that there are only 5 divine caliphs. There is in fact a group of 'fivers' who are Shia. You heard them in the news referred to as Houthis. Its a subject that doesn't interest me and probably shouldn't concern anyone who's not Muslim. Why you would single out 'twelvers' as some sign of radical craziness is beyond me. ISIS is STRICTLY a Sunni operation. Iran and all Shia are their sworn, hated enemy. Iran and the various Shia militias it backs are the ones taking and dishing out the most direct punishment to and from ISIS.</p><p>As usual, right wingers can't seem to grasp that this is a complicated world and we have more than one enemy and some of our enemies hate each other more than they hate us. Partial and incomplete knowledge is just as bad as ignorance.</p>", "size": 16}, {"author": "disqus_KIS55WcSeC", "children": [{"author": "1Pokey4", "children": [], "name": "<p>\" ...I don`t think they are a huge part of ISIS.\"<br>They don`t form any part of ISIS at all. As a matter of fact, they would be one of the biggest losers in an ISIS controlled region.</p>", "size": 11}], "name": "<p>Iran is a dangerous country and I understand their political and religious goals.  However, I may be way off base on this, I don't think they are a huge part of ISIS.  Iran is Shia and ISIS is Sunni.  When Americans aren't around, the favorite past-time of those two groups is picking each other off.</p><p><a href=\"http://timesofindia.indiatimes.com/world/middle-east/4-questions-ISIS-rebels-use-to-tell-Sunni-from-Shia/articleshow/37257563.cms\" rel=\"nofollow\">http://timesofindia.indiatimes...</a></p>", "size": 7}], "name": "<p>The article goes into a lot but just simply look up twelvers. That is what  is running IRAN NOW and why  so many other countries have fear of them: He is not espousing anything new just putting it all together in plain from so many can grasp it. Iran is the power behind it all,  with very wealthy Muslims playing with it also.  Playing both sides of the fence. Iran  is itching for the end of the world,  look up twelvers and the Mahdi same crap talk, but Obama is allowing those nuts to build a bomb. Has anyone told  the Turks they are to be sacked and burned yet, i think not!?</p><p>Another group of fanatics that can be shutdown any time by surrounding them in place where  they sit on land and starve them out period.   That is what needs to be done now. Cut all communications to he outside  NOW like a cancer. surround it and cut it out. I am not talking ideology,  just of destroying a disease. THEY WANT TO BE SAVAGE, show them what it can be,  no  more TV or communications out side block or jam it if you really want it stopped.  Any air Campagne  should be going to cut all communications ties, isolated them and then kill  them.  Cut electric power and you cut comms, dark ages put them in it! And the young thugs want find it so romantic any more no slaves, no money as long as that last it last. So shut up and  cut off the money supply! And all communications: they want to act like it is seven hundred  years ago then give it to them for real.   No more electric, no coms all dark ages, to include no toilet paper. Cut water supplies to he cities,  transportation in and out, cut it all most important food stuff and electricity. to areas they hold. Watch the rats run. But liberals will say but the innocent!  Really kind of late to think about that is it  not!<br>No one can communicate with a savage really!  Look up the meaning of savage.<br>The key to wining is keep the western press out period kill and kill and keep on killing until they run out, as they will.  Slick press and Internet needs money where is it coming from shut it down! The recruitment adds real slick but, liberals will drown in heir own excrement  and blood before doing anything. \"We need to have empathy for them \" Hillary  Cartoon, RIGHT up to the time they cut your head off Hillary!</p><p>The article is good but the Pentagon is spending millions for this info and it is all over the internet, just look up again Mahadi and twelvers! Or listen to the Mullas speeches the radical ones not new just being seen in action for what they are! They actually believe this stuff and sell it but we just take it as a game!</p>", "size": 7}], "name": "<p>Every missile sent, every bomb dropped, and every round fired into ISIS is money well spent.</p><p>This is the best and most disturbing article I've read on this site.</p>", "size": 35}, {"author": "NoldorElf", "children": [{"author": "disqus_YDmGVCFdkK", "children": [{"author": "veerkg_23", "children": [{"author": "disqus_YDmGVCFdkK", "children": [{"author": "veerkg_23", "children": [{"author": "jericho", "children": [], "name": "<p>GWB was rattling sabers at Saddam before he was even elected.</p>", "size": 3}], "name": "<p>\"Mushroom clouds over NYC\" was the excuse used for justifying invasion. Shooting at planes was dealt with shooting back at aa sites. Saddam was contained, but that wasn't what Bush was arguing for.</p>", "size": 8}, {"author": "marik77", "children": [{"author": "disqus_YDmGVCFdkK", "children": [], "name": "<p>I \"imagine\" --in the same context ---that if the USA lost a war--lets say with Canada and we signed an agreement not to shoot at Canadian planes patrolling the agreed upon zone---that they would keep their agreement.</p><p>At least until such time as they had a reasonable chance of winning the conflict shooting at the planes would kick off.</p><p></p>", "size": 1}, {"author": "marathag", "children": [{"author": "disqus_YDmGVCFdkK", "children": [{"author": "veerkg_23", "children": [], "name": "<p>Actually we started the shooting - see Desert Fox in 1998.</p>", "size": 2}, {"author": "evangelical", "children": [], "name": "<p>No one agrees with you.  Iraq today is US's fault, not Saddams.  Take some fuchking responsibility you piece of $hit.</p>", "size": 0}], "name": "<p>So?</p><p>We all set down and agreed on the terms of cease fire. Saddam violated it. So the cease fire is void, so the shooting starts again.</p><p>His choice. A really bad one but that is what he decided to do.</p>", "size": 1}], "name": "<p>Veto on security council was not used to prevent that over Iraq.</p><p>Nobody else on earth can actually make a ' No Fly' zone over something the size of Texas, let alone the rest of the 50</p><p>There isn't the logistics capability to operate that far from home bases, except for when the USA is involved.</p>", "size": 0}], "name": "<p>The \"no fly\" zone was the imposition of a foreign country. If another country declared a no fly zone over the US, I imagine the US would do something about it.</p>", "size": 6}], "name": "<p>If memory serves there was a pretty lengthy and detailed list of reasons for ending the cease fire.</p><p>Such as shooting at the planes patrolling the \"no fly\" zone, illegal importation of more weapons, illegal importation of spare military parts etc etc. not as \"sexy\" as WMD's but violations of the cease fire agreement none-the-less.</p><p>And when you violate a cease fire the penalty is the shooting starts again.</p>", "size": 6}], "name": "<p>It wasn't the rationale at all, since there were none. It was the excuse, one that people were readily inclined to believe as it made it a matter of trust between Bush (post 9/11 high) and Saddam (who few were willing to defend).</p>", "size": 17}, {"author": "Anonymous", "children": [{"author": "disqus_YDmGVCFdkK", "children": [{"author": "Anonymous", "children": [], "name": "<p>it doesn't work for your argument anyways. The middle east isn't strongly isolated by country, it's a cultural region. You might have an argument here but your support provided does pretty much none of the work you need it to.</p><p>also the letter to america's main attack was citizens voted and supported for the US government and it supported countries like Egypt.</p><p>though it was produced after 9/11 as jihadists pointed out Bin Ladin had violated islamic law by attacking before a declaration of war was declared.</p><p>essentially 1 sentence rebuttals don't actual refute reasonable claims and the rebutal seems to take the form of a simplistic and uncharitable view of OP's arguments. actually refuting the assertions really does require something of some length.</p>", "size": 0}], "name": "<p>Agreed, we backed them--but the context I was replying to was \"invasion.\" We didn't invade Yemen nor Egypt either.</p>", "size": 0}], "name": "<p>we did pretty strongly back the Yemani establishment and that has a tribal component as well. Yemen doesn't really work as a counter example (though the alternative history thought expierement for the middle east is always going to be deeply flawed given how much change is being wiped away and replaced with assumptions)</p>", "size": 2}], "name": "<p>Nah....what you describe are pretexts. People that slaughter children for watching soccer games will find any excuse for their barbarity. Attempting to rationalize why irrational people do irrational things is largely futile.</p><p>Besides OBL publically stated why he launched his attacks in his letter to America. Among them were our tolerance of homosexuality and allowing women to serve in positions of power...if memory serves.</p><p>How about Yeman--didn't invade there and their homegrown wackos have just seized power.</p><p>Oh...and the WMD thing...that was only ONE of laundry list of reasons why the USA invaded. Not the sole rational.</p>", "size": 22}, {"author": "ilyakipnis", "children": [{"author": "veerkg_23", "children": [{"author": "ilyakipnis", "children": [{"author": "veerkg_23", "children": [], "name": "<p>Nice theory, except Ho Chi Minh was really popular in South Vietnam as well (which is why we never held the promised elections there). Sure hitting the Soviet Union (and China) would have escalated the war, and killed many more people (even if it didn't go nuclear). How would that have helped?</p>", "size": 6}, {"author": "marik77", "children": [{"author": "ilyakipnis", "children": [], "name": "<p>Oh, all sides do it, to be sure.</p>", "size": 1}], "name": "<p>The Communists were providing weapons, at no cost in blood to their actual citizens. Sound familiar?</p>", "size": 3}], "name": "<p>The problem with Vietnam was that there were Soviets in the area (aka who was providing all the weaponry to the Vietnamese?). Hit them as collateral damage, and the cold war suddenly turns hot and humanity goes extinct thanks to nuclear winter.</p><p>What about here?</p>", "size": 4}, {"author": "Anonymous", "children": [{"author": "veerkg_23", "children": [{"author": "willallen2", "children": [], "name": "<p>The Roman Empire was extremely successful, and it was not it's policies towards non-Romans which led to its fall. The fact that it was not permanent is not notable. Nothing is permanent.</p>", "size": 3}, {"author": "Anonymous", "children": [], "name": "<p>i'm not sure the end of the roman empire works as a cautionary tale. 400 years later the empire fell in the west isn't a scary proposition (and the empire coopted the elites/people who lived in those areas  to think of themselves as Roman).</p>", "size": 1}], "name": "<p>A cautionary tale, given how the Roman empire ended.</p>", "size": 2}], "name": "<p>no Tacitus:</p><p>They [the Romans] make a desert and call it peace.</p>", "size": 0}], "name": "<p>This is the Vietnam argument rehashed.</p>", "size": 8}, {"author": "M8281", "children": [], "name": "<p>People forget that Japan and Germany were industrialized powers before the war. The U.S. ended up helping to rebuild economies and systems of government that, for the most part, existed prior to the allies bombing them to ash. No such structure exists in the Middle East.</p>", "size": 1}], "name": "<p>Eh? Every time I hear someone say \"military force is counterproductive\", what I think is: \"that's because not enough is applied\".</p><p>The developed world probably has enough in its arsenal to send the world into nuclear winter. It probably has far more than enough to just bring down the hammer on a bunch of savage murderers with small arms in pajamas until the will to fight is broken. It worked in Germany and Japan. Why exactly has the world gone soft in thinking that it won't work now?</p>", "size": 7}, {"author": "Anonymous", "children": [], "name": "<p>to be fair the \"pay for itself with oil\" argument is actually grounded mostly on sound assumptions which have been proven correct (explosion of iraq's oil industry for instance). They only made one small fault in their calcualtions</p>", "size": 0}, {"author": "Holdfast_II", "children": [], "name": "<p>\"It is amusing how absurd that sounds today. Less amusing is that many of<br> the people who advocated for the war remain in positions of influence <br>and power.\"</p><p>Like Hillary Clinton?  Or John Kerry?</p>", "size": 0}], "name": "<p>What is appalling about this is how self-inflicted this is.</p><p>This is the sort of Blowback that Chalmer's Johnson was describing that the US would experience. Far from weakening the crazy fundamentalists, the actions of the US have worsened the problem substantially.</p><p>One of the things I would like to note is that had the Bush Administration never invaded Iraq in 2003 under the false pretext that Saddam had nuclear WMDs that he was about to use or that he had anything to do with the 9-11 attacks, this would probably have not happened. Saddam, although a horrible, evil man, was a stabilizing force in a very unstable region of the world.</p><p>After reading this, I actually pondered about back the statements that the Bush administration made in 2002 and 2003. There's one about how Iraq would pay for itself via oil revenues made by Wolfowitz for example. It is amusing how absurd that sounds today. Less amusing is that many of the people who advocated for the war remain in positions of influence and power.</p><p>In some ways, this resembles what happened in Iran (the government of Iran that was democratically elected was overthrown in 1953 by the CIA and the Shah installed, which ultimately led to a fundamentalist revolution in 1979).</p><p>The real question is, now what? Historically, military force has been mostly counterproductive. It has increased, rather than decreased support for Islamic fundamentalist groups. Strategic bombing too has historically hardened the will of a population rather than reduced it. The UK for example views the Blitz as perhaps their finest hour in their nation's history.</p><p>It may very well be that some degree of containment is the only viable strategy, while never bombing or entering their territory. Remember, Iraq is a relatively secular nation (for an Islamic nation anyways). The actions of ISIS are at odds with the Sunni inhabitants, who only supported them because of the injustices that they received under the Shi'a led government and the US occupation. Eventually it will collapse internally I would imagine.</p>", "size": 31}, {"author": "disqus_JERozSdloE", "children": [], "name": "<p>This article is a must-read for anyone seeking to understand how ISIS operates and how they might eventually be eliminated.</p><p>I can't say that I could ever enjoy reading about the group and their atrocities, but I came away from this piece having learned a fair deal that I did not know beforehand.</p>", "size": 30}, {"author": "disqus_zGod6tGdQV", "children": [{"author": "Anonymous", "children": [], "name": "<p>thus why states for thousands of years have justified persecuting minority religions</p>", "size": 2}], "name": "<p>Any religion that upholds the use of violence to achieve its aims, and requires all to acknowledge its sovereign supremacy is inherently hostile to and an enemy of humanity.<br>It is a disease and a curse upon all men and women.<br>And should be de-Nazified so that we may be saved.</p>", "size": 30}, {"author": "disqus_59KZkHgegx", "children": [{"author": "atejas", "children": [], "name": "<p>The 'overriding themes' change military and political reality not one iota.</p>", "size": 0}], "name": "<p>\"The Islamic State differs from nearly every other current jihadist movement in believing that it is written into God’s script as a central character.\" <br>That makes \"divine right of kings\" sound like a mark of humility. When the overriding theme is a return to (with divine sanction) 7th century mores, power structures and criteria for martyrdom, it's time to \"gird your loins\", fellow Christians, Jews and other assorted infidels.  <br>\"The war is thrust upon us.\"-- Lincoln</p>", "size": 23}, {"author": "disqus_4iScQ2WAJ3", "children": [{"author": "veerkg_23", "children": [{"author": "disqus_4iScQ2WAJ3", "children": [{"author": "ClausRasmussen", "children": [{"author": "neuroticknight", "children": [], "name": "<p>Yup, Hitler was a good artist, orator , so no surprise he was good writer, George Orwell complimenting his writing, no way means he endorsed his actions.</p>", "size": 0}], "name": "<p>He didn't judge, he made an observation of what motivates people</p>", "size": 3}, {"author": "veerkg_23", "children": [], "name": "<p>We've just been without genocide on the west for a while. At the time knowledge of mass deaths in Russia/Ukraine, Turkey/Armenia, China and India (frequent famines in peacetime) were quite common. Not to mention the actual conduct of the war - city bombing and eventually nukes. People weren't so much shocked by Nazism as determined that things could not go on that way (and then of course the cold war happened).</p>", "size": 1}], "name": "<p>Perhaps, but in hindsight, now knowing what was to come, it seems callous.</p>", "size": 1}], "name": "<p>Orwell was just channeling his ability to see, and explain, the other side. He was in no way defending fascism, indeed he was one of the first opponents of it (having fought in the spanish civil war). In 1940 Britain was already at war with Germany.</p>", "size": 10}, {"author": "azt24", "children": [{"author": "colmmackernan", "children": [], "name": "<p>\"Hitler hid his full intentions from the world.\"</p><p>Uh, no he did indeed state his full intentions.  People did not take him seriously, thought it was just rhetoric, \"red meat\" to throw the masses, including his biggest financial backer Fritz Thyssen, Germany's richest man, who ended up fleeing the regime and in exile proclaiming \"Ein Dummkopf war ich!\"</p>", "size": 1}], "name": "<p>Yes. One should remember that Hitler hid his full intentions from the world. ISIS, otoh, proclaims them....</p>", "size": 3}], "name": "<p>In defense of George Orwell, his quote about Hitler's \"underdog quality\" was from 1940, before the full horrors of Nazi Germany were known  and in fact before the mass killings of Jews had begun.</p><p>Nonetheless, a well researched and well written article. Well done.</p>", "size": 22}, {"author": "JohnJMac", "children": [{"author": "toasttoyou", "children": [], "name": "<p>I think both climate change and this should be a priority.</p><p>Having said that, I totally agree, the genius of this article is that the author basically listened to ISIS, rather than interpretations of it</p>", "size": 2}, {"author": "Anonymous", "children": [], "name": "<p>many people do (read looming tower), the problem is getting voices heard and ranslating analyst ideas into policy and ignroing the bad ideas</p>", "size": 1}, {"author": "disqus_xqGamn8D0K", "children": [{"author": "JohnJMac", "children": [{"author": "JosephAndrews", "children": [{"author": "JohnJMac", "children": [], "name": "<p>I certainly didn't mean to imply equivalence between those who behead apostates and those who try (imperfectly for sure) to live by the creed to \"love your neighbor as yourself.\"</p><p>What I do mean, however, is that the left tries to apply classic Marxist thinking (class division/economic determinism) to explain the actions of groups like ISIS and Al Q.   They also think that these groups will respond rationally to diplomatic carrots.  In my opinion, this thinking is simplistic and two dimensional, like the inputs of an economic equation.  Clearly, people who are willing to blow themselves up - as long as they take some infidels with them - aren't wired like the old Soviets for example.  What clouds the leftist thinking - in my opinion - is that the jihadis shrewdly co-opt the language of the left when they criticize the West, particularly the U.S.A.  It's hard understand people who seem to hate Christian conservatives more than they hate those who would happily behead them.  Or at least try to paint all religious people with the same, stupid broad brush.</p><p>In my opinion, Christians generally have a deeper understanding of both 1) the tenets of the Muslim faith; 2) the stark differences in both the character and message of Mohammed and Jesus (one was a warlord/the other was a sacrificial servant leader) and 3) the deeper motivations of those who are driven by what they believe about the next world instead of those who live for this world.  After all, 11/12 disciples were martyred by the Roman Empire.</p><p>I will close with a quick story.  I knew a fellow from Charlotte, NC, who grew up as an upper middle class white guy and graduated near the top of his class at UNC Medical school.  After graduation, had his choice high-paying jobs in pleasant places. Instead, he moved his family (including two small children) to Chad, where he served for 5 years as a Christian medical missionary.  I cannot even begin to describe the danger, privation and sacrifice that he and and his family endured.</p><p>On the other hand, we had 19 young Saudi men who flew airplanes into buildings on 9/11/01.</p><p>Both of these people were clearly driven by values NOT of this world.  But, they are hardly \"equivalent.\"</p><p>By their fruits, you shall know them.</p>", "size": 5}], "name": "<p>JJMac: ...enjoy reading your posts.</p><p>You wrote this:</p><p>\"Conservatives certainly aren't perfect, but - given that many conservatives are also committed Christians who understand both the Christian Book of Revelation and have also studied Islam in some depth (many churches, like ours, sponsored education about both of these topics after 9/11) - they are much better positioned to understand the theology and emotional appeal of a message with elements of apocalyptic/messianic/self sacrifice mixed in.\"</p><p>A schoolyard yell is... 'it takes one to know one'.</p><p>Surely this isn't what you intend to say/imply, is it?</p><p>Making an equivalence between fundamentalists of all stripes (say, Christians and Muslims, for example)?</p>", "size": 0}], "name": "<p>Er - I have to agree with azt24.  Conservatives certainly aren't perfect, but - given that many conservatives are also committed Christians who understand both the Christian Book of Revelation and have also studied Islam in some depth (many churches, like ours, sponsored education about both of these topics after 9/11) - they are much better positioned to understand the theology and emotional appeal of a message with elements of apocalyptic/messianic/self sacrifice mixed in.</p><p>In my opinion, it is the left who consistently misunderstands both the theology and the emotional appeal of the theology.  For example, our President seems to think that if he simply does the opposite of whatever Bush did, that Muslims will love us, or at least stop hating us.  Also, many \"intellectuals\" who post about the undeniable link between Islam/the doctrine of jihad/and the longing to re-establish the Caliphate want to explain actions like suicide bombings and other acts of mass terror due to simple economic determinism with undercurrents of Marxism.  In other words, they kill us because they're poor and oppressed.  This, of course, ignores the role of one of the richest countries in region - Saudi Arabia, which is neither.</p>", "size": 5}, {"author": "azt24", "children": [], "name": "<p>\"I am positive this article could not be put over on Fox and be understood\"</p><p>I think you're quite wrong about that. There is nothing in the conservative worldview that hinders taking on more information on the peculiarities of the ISIS sect. It is progressives who have been denying that ISIS is Muslim <i>because how could you be so racist!?</i></p>", "size": 5}], "name": "<p>I am positive this article could not be put over on Fox and be understood, so maybe that also applies to 99% of politicians too.</p>", "size": 1}], "name": "<p>As obvious as this sounds, what is great about this article is that author actually <i>listened</i> to what ISIS is actually saying, instead of grafting his preconceived notions onto this bizarre death cult.  You wonder why our the $100B+ a year we spend on the State Dept and Homeland Security don't produce more people with this capability.  Instead, we think that \"climate change\" should be the priority.</p><p>It's madness.</p>", "size": 19}, {"author": "AndrewMelville", "children": [], "name": "<p>That's great news if the Muslims are now all obliged to emigrate to go live under the Caliphate in Syria. Can we get HM's government to lend a hand here?  Imagine fleets of cruise liners at the docks to take the willing believers to join the Caliphate!  Imagine mountains of passports and birth certificates piling up as the faithful turn their backs on dear old Blighty!</p><p>You know I think I'm beginning to think more highly of this ISIL crowd. </p>", "size": 15}, {"author": "sweetjazz3", "children": [{"author": "azt24", "children": [{"author": "sweetjazz3", "children": [{"author": "azt24", "children": [], "name": "<p>Most of the areas Daesh controls have lived on smuggling for centuries. I don't know if Daesh has arranged for a cut of the business or not.</p><p>\"As heinous and heartbreaking as their barbaric acts are, the increase in  frequency and sloppiness is a sign that Daesh's position is eroding.\"</p><p>I fear you are looking at them with Western eyes. To their audience, I think it is a sign of daring and confidence.</p>", "size": 0}], "name": "<p>Sure, the oil revenue has been crucial for controlling their territory so far.  The drop in oil price has hurt them, as has the US bombing campaign.  Their main problem is they have no economic diversity.  Outside of oil and criminal extortion (e.g. receiving ransoms for hostages), they have almost no economic activity.  And the vast bulk of their budget is for military activities.  Hence, damage to their two main industries has a much more disproportionate impact on their military capabilities than would occur in a state with a functional economy.</p><p>There's a reason why their rapid territorial sweep in the summer has turned into a territorial drip in the fall and winter.  Initially, they were beheading a single hostage a month and that was enough to bring recruits around the world.  Now, they are killing hostages much more often and, from what I understand, the production value of videos (which are no longer consistently produced) has gone down (I don't actually watch their videos myself).  As heinous and heartbreaking as their barbaric acts are, the increase in frequency and sloppiness is a sign that Daesh's position is eroding.  They won't implode fast enough, but they are on a path to implosion.</p>", "size": 1}], "name": "<p>ISIS has oil revenues, which could delay your point 3 implosion for quite a while.</p>", "size": 2}, {"author": "Anonymous", "children": [{"author": "sweetjazz3", "children": [{"author": "Anonymous", "children": [{"author": "sweetjazz3", "children": [], "name": "<p>Sure, and I am not a Koran scholar, so I cannot argue specifics of the prophesy.  But given that the prophesy foretells of people fighting on horseback and that there will be an eventual reduction of their force to 5000 before God leads them to a miraculous comeback and ultimate victory, I am going to assume that even if they were completely routed at Dabiq, much of the hardcore element would see that defeat as simply an obstacle to their ultimate decisive victory at Dabiq that will come later.  So they'd simply launch an insurgency campaign, wait (weeks ... months ... years ... whatever it takes) for the US forces to leave, and declare victory when they do.</p><p>Keep in mind that only a fraction of the actual Daesh fighters believe this armageddon nonsense anyway.  Graeme Wood has a nice piece in the New Republic outlining the different types of fighters in the Daesh army.  The key to their maintenance of power so far has been an alliance with the Sunni tribal leaders in the area.  Many of these leaders intend to get rid of Daesh once they are no longer useful, but find them currently useful in undermining the Shiite government in Baghdad (which under al-Maliki committed unspeakable acts of torture and depravity against Iraqi Sunnis).</p><p>I think the current strategy of tactical bombing to help allies fight Daesh is probably the best option among the ones available to us.  It will not loosen Daesh's hold on the Sunni tribal areas very quickly (nobody else in the region is particularly interested in trying to occupy those areas), but will eventually lead to the gradual erosion in Daesh's credibility as an expanding caliphate.</p>", "size": 0}], "name": "<p>except while their claims fail popper's falsifiability test, a decisive defeat would greatly diminish their prestige and dissuade people outside the core from associating with ISIS. Harold Camping wasn't a big deal, if 20% of america believed in Camping he would be a much bigger deal and each failed prophecy actually did reduce his ability to attract a higher % of population as converts.</p>", "size": 0}], "name": "<p>I didn't see many benefits to US occupation discussed in the article.  The military defeat of the caliphate certainly will cripple the raison d'etre of Daesh.  But it is not clear that US troops could ever accomplish this through overwhelming ground forces.  Daesh would likely adapt to insurgency strategies (such as the ones that gave root to the organization in the early 2000s), and once the US inevitably tired of the massive costs of trying to occupy the area, the US would declare victory and go home, only to see the remnants of Daesh restart a military campaign to reestablish the caliphate.</p><p>The other idea is that we could defeat them overwhelmingly at Dabiq in a traditional ground battle and invalidate their prophesies.  But that misses the point of how fundamentalist religions operate.  Daesh is an organization full of propagandists and Koranic scholars.  It is always possible to reinterpret the texts after the fact to align prophesy and reality.  (Think of the goofy Harold Camping prophesies for the end of the world that kept getting moved back each time they were falsified.)  Fundamentalism has this curious mentality that the current interpretation is absolutely correct until it is directly falsified; it is then reinterpreted to fix the inconsistency and <i>that</i> interpretation becomes absolutely correct until ... and the cycle continues.</p>", "size": 3}], "name": "<p>though as he notes, 4 does have strong benefits if done well.</p>", "size": 0}], "name": "<p>The article hits the main points really well.</p><p>1)  The Islamic State is certainly Islamic.</p><p>2)  Within the Muslim world, the Islamic State has a lot of enemies and the allegiance of a minuscule fraction of Muslims around the globe.</p><p>3)  The Islamic State will, by its own design, eventually implode.  The author did not even go into their lack of a functioning economy.  The salaries of the vast majority of the populations that they control are paid for by the governments of Iraq and Syria.  Most of their revenue goes directly to pay their military costs.  Free welfare isn't worth much if the provider does not have the means to provide and sustain it.</p><p>4)  The United States has limited ability to control the destiny of events.  A US ground presence would be an enormous propaganda win for IS.  Though we could rout their ground forces in Iraq pretty easily, there is no viable option to fill the power vacuum that would result.  We would be back where we were in 2003 in Iraq, with an extra 12 years of poisoned Sunni-Shia relations added to the already toxic feelings between them.</p>", "size": 14}, {"author": "jihadi_jane", "children": [{"author": "choomster", "children": [], "name": "<p>You jest I am sure☻</p>", "size": 0}], "name": "<p>We ISLAMIC Terrorists wish to thank all DEMS and leftwingers for being our friends in the struggle!!</p>", "size": 11}, {"author": "genesissaboteur", "children": [{"author": "veerkg_23", "children": [{"author": "genesissaboteur", "children": [], "name": "<p>Yeah, it should make someone wonder why people from all around the world, from every walk of life, speaking hundreds of different languages, living in vastly different cultures for thousands of years still believe something supernatural is going to bring an end to the world as we know. Huh. Maybe that makes you think? maybe not.</p>", "size": 0}], "name": "<p>Jerusalem was destroyed and \"taken\" many times in the past 2000 years. You'd have thought people would have realized that no divine apocalypse is coming by now.</p>", "size": 9}], "name": "<p>Mr. Wood presents an excellent portrayal of ISIS. And finally, someone admits the obvious, ISIS is Islamic to its core. This is an Islamic organization acting on a set of beliefs. They are \"authentic throwbacks to early Islam and are faithfully reproducing its norms of war\" because its literally written in the Koran.</p><p>Mr. Woods argues for containment and a willingness to accept the continued rape, slavery, murder, and evil that will continue under ISIS. Eventually, they will burn themselves out.</p><p>But he adds one caveat that truly is tenuous at best.</p><p><b>\"if the Islamic State obtained the allegiance of al‑Qaeda—increasing, in one swoop, the unity of its base—it could wax into a worse foe than we’ve yet seen.\" </b></p><p>If other Muslims decide that following Allah means more than \"personal hygiene and inner peace,\" then we truly will experience the Apocalypse. How ironic (insert sarcasm here) that the Bible speaks of the End of Days being when the nations will rise up against Israel. Even Mr. Woods points out that destroying Israel and retaking Jerusalem is one of Islam's greatest objectives. It's just ignorance to sit back and reject the reality that the potential for this WWIII is literally at our doorsteps.</p>", "size": 10}, {"author": "quix0te", "children": [], "name": "<p>This was an immensely informative read.  This is the kind of journalism to which The Atlantic and other news outlets should aspire.  <br>I find it a mix of hilarious and horrifying that people can read this and then somehow pivot to our petty politics.  As if either party has a better handle on this phenomenon.</p>", "size": 9}, {"author": "Damascusdean", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "WormGetter", "children": [], "name": "<p>Yeah.  I remember peace, love and progress spreading throughout Iraq and the rest of the Arab world, until that darned Democrat pulled the plug on our endless combat deployment over there.  Darn him!</p><p>It should be noted that we stayed in Europe, Japan and Korea after we first won the war.  We were still in combat in Iraq, and we were hated occupiers, and Iraq was falling apart when we left.  </p>", "size": 6}, {"author": "dcreade", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "dcreade", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "dcreade", "children": [], "name": "<p>...</p>", "size": 0}], "name": "<p>Are you ever going the shed the bad habit of asking false questions ??</p>", "size": 1}], "name": "<p>What obligates us to jump into the middle of an internecine conflict between the locals in the deserts of Iraq and Syria?</p><p>Nothing, thankfully. Since we left before Phase II of the neocons' grandiose geopolitical strategic vision could swing into full effect. </p>", "size": 3}, {"author": "Damascusdean", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "Damascusdean", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "Damascusdean", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "Damascusdean", "children": [], "name": "<p>How can I make a false accusation when you provided the words?</p><p>You are not very self reflective I take it.</p><p>And why would someone pay me to respond to lunatics on the internet? </p>", "size": 1}], "name": "<p>Your posts are a litany of lies and false questions.<br>Do you get paid to do this ?</p>", "size": 2}], "name": "<p>Projection? You are the one quoting Patton. You are the one saying kill them all. I don't have to project anything.</p><p>Or are you just being a parody of yourself?</p>", "size": 1}], "name": "<p>You really are a fucking asshat.</p><p>Thanks for the demonstration</p><p>I'm not responsible for your stupid projections<br>Your strawman<br>YOU feed it.</p>", "size": 2}], "name": "<p>OK. So your solution is total war on the entire Middle east,</p><p>Thanks for sharing.</p>", "size": 1}], "name": "<p>General Patton had the best answer to your question.</p><p>\"Your job is not to die for your country..<br>Your job is to make the other poor son-of-a-bitch die for his.\"</p><p>When it comes to islamists, my position is:<br>\"Kill them all.<br>Allah will know his own.\"<br></p>", "size": 2}], "name": "<p>There is a civil war between Shia and Sunni. Who should we side with, Iran's or ISIS? Which of those do you want to die for?</p>", "size": 2}, {"author": "disqus_g48L9XLdp5", "children": [], "name": "<p>The Middle East has always been a mess. The war is in half of Iraq and Syria. It is persisting because ISIS was able to get a $200 millions worth stash of Iraq weapons last June, and because they still look one at another and waiting for who is going to fight.</p>", "size": 0}], "name": "<p>HELLO ??<br>Are you trying to tell is there is NO \"regional war\" in effect ??<br>Are you really this clueless ??</p><p>The rest of your nuttery is not worth a response.</p>", "size": 1}, {"author": "WormGetter", "children": [], "name": "<p>Yes, this fantasy that had Obama only left our GIs in a hated occupation and combat forever would have resulted in peace is just that, a fantasy.  We'd still simply be hip deep in blood fighting these evil bastards today, with no end in sight.</p><p>We need to grow up and recognize what we can and can not do, and do what we can.  This idea that we can fully control outcomes over there is absolute nonsense.</p>", "size": 0}], "name": "<p>The initial power vacuum was created when the US invaded. Keeping a lid on things while feeding the tribal chiefs of Anbar billions in protection money is not to be confused with permanent peace or reconstruction.</p><p>If a garrison of 30,000-50,000 US troops had remained, I think there's every likelihood that the Syrian rebellion against Assad would have led to US combat unit involvement. And, in short order thereafter, a regional war.</p><p>And it's plain that many people in the comments here would be just fine with that. They're seeking nuclear conflagration. Mass civilian casualties, against an adversary that doesn't have a navy or air force, or even much in the way of air defenses- unless one counts US allies like Egypt, Saudi Arabia, Jordan, and Turkey, that is; it's clear that half of the bloodthirsty American militarists don't realize that those countries have friendly relations with the US, and the other half are perfectly fine with putting them in the Enemy column.  Right down to the newborns.</p><p>Many of the advocates of mass murder are of course Fundamentalist Christians, primed with tales of the End Times ever since Hal Lindsey got their juices flowing with <i>The Late Great Planet Earth</i> back in the 1970s. Now they're in post-prophetic mode- due to the failures of various Dispensationalist nutcase predictions of Armageddon over the past 40 years- and they just want to get the ball rolling somehow. While they prattle on about how merciful and kind their brand of \"Christianity\" is. Their fantasies are always remorseless and bloodless- cleansing fire- and the typical tone seems to indicate that they expect to watch it all happen over the course of a fortnight, tuned in to their brand-new state of the art HD TV sets and receiving more the same Entertainment Value that CNN made its name with during the 1991 Gulf War. When we \"licked the Vietnam Syndrome\", according to then-President George Herbert Walker Bush. While they munch Hot Pockets and corn chips. An era that some of them obviously consider to be the Golden Age of their Youth. The good old days of 1991, watching that cruise missile hit the bridge. Better than a movie, because real! While they're safe at home, 7000 miles away. Having done their part, by calling everyone who isn't on board with nuclear annihilation chickens. Perhaps while rounding them up as terrorists.</p><p>This is not my fantasy; I'm merely providing a brief and incomplete outline of the implications of what the ultra-Right American \"nuke the Muslims into peace\" crowd is demanding. (Because they won't do it themselves.) Although maybe I'll hear from the \"moderate\" faction soon, pitching the soft sell that carpet bombing Mecca and Medina (and Tehran, and Damascus, and Baghdad, and Riyadh, and Kabul, and Islamabad, and Cairo, and Amman, and Istanbul, etc.)  with conventional weapons should \"do the job\" just as well.</p><p>You think I'm exaggerating? Read through the comment thread a ways.</p><p>This annihilation of all Muslims everywhere is typically pitched as a pre-emptive self-defense measure. Or that's simply tacitly implied. Taken for granted. (The ability of the bloodlust fantasizers to take things for granted is truly amazing.) Sometimes the appeals are mixed in with pronouncements of unctuous piety. Conversion by the Bomb. Along with denunciations of Islam, for its radicalism. </p>", "size": 6}, {"author": "Damascusdean", "children": [{"author": "channelclemente", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "channelclemente", "children": [{"author": "disqus_hh6Xrjtbul", "children": [], "name": "<p>Oh yawn..</p><p>The suck-up is unhappy</p>", "size": 1}], "name": "<p>...and you make the same simplistic, sophomoric arguments you always have.  At least you are consistent and dependable in that regard.</p>", "size": 1}], "name": "<p>Stupidity and ignorance are known to do that.</p><p>It's not that hard to repeat what you have been spoon-fed without any attempt to fire up a neuron along the way.<br>He gives a consistent demonstration of that.</p>", "size": 2}, {"author": "disqus_g48L9XLdp5", "children": [], "name": "<p>I second that.</p>", "size": 0}], "name": "<p>You are an individual of near infinite energy and patience.  I envy you, my friend.</p>", "size": 3}, {"author": "disqus_hh6Xrjtbul", "children": [{"author": "Damascusdean", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "Damascusdean", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "Damascusdean", "children": [], "name": "<p>Now you have gone and made me feel bad. I try so hard to win your approval.</p>", "size": 0}], "name": "<p>YAWN !</p><p>Time to killfile you.<br>Your posts are just an overload of stupid.</p>", "size": 2}], "name": "<p>Yeah well that initial plan didn't work out so well when the locals decided to be an uncooperative recipient of our occupation.</p><p>But cheer up. We can always go back. We have a navy, marines, tanks, etc. We can draft a few million more foot soldiers and go for WW3. We should be able to teach them our ways in no time.</p>", "size": 1}], "name": "<p>That should have been the plan when we went in.<br>Such changes take about 2 generations to actually take root and grow.</p><p>Now since we are out, that is irrelevant.</p><p>But hey, if you want to argue stupid.<br>No skin off my back.</p>", "size": 2}], "name": "<p>So in your estimate, all we need to do is occupy Iraq, Syria, Yemen, Libya, and God knows who else for 40 or 50 years and we can straighten the place out right?</p>", "size": 2}, {"author": "WormGetter", "children": [], "name": "<p>But we fully won the war before we occupied those countries.  We hadn't been able to get a handle on Iraq even militarily, let alone politically, by the time we left.  In 2008 alone, the year where partisans pretend \"peace,\" \"victory\" and \"stability\" reigned, 10,000 Iraqis died of sectarian-terrorist violence.  That was the \"good\" year, mind you.</p><p>Our GIs were hated occupiers in constant low level combat, not welcomed partners in peace keeping.  The post-WWII and Korea analogies are terrible.</p>", "size": 0}, {"author": "disqus_g48L9XLdp5", "children": [], "name": "<p>Germany is to Iraq like Somalia to US.....</p>", "size": 0}], "name": "<p>That's a crock</p><p>Neither Germany nor Japan were'smashed to smithereens\"<br>The whole social and government structure that was in place before, was in place after.<br>Not only that, but we helped them rebuild.</p>", "size": 1}], "name": "<p>No...not really. The power vacuum was already there, whether we maintained a small garrison or not. The Shia controlled the government and were hammering the Sunnis. Other than taking the place over and governing them ourselves, we have no good options.</p><p>Germany and Japan were both modern, secular countries that we smashed to smithereens in war before we occupied them. Bad analogy with Iraq, the same one that got Bush and Cheney into trouble.</p>", "size": 4}, {"author": "clewish09", "children": [], "name": "<p>Who agreed to the complete troop withdrawal (as if that matters)? You partisans have no desire for resolution, it seems, only to ensure the 'other guys' get the blame...</p>", "size": 3}, {"author": "disqus_g48L9XLdp5", "children": [], "name": "<p>Bush announced in 2008 a deal for withdrawal to be executed in 2012.....</p>", "size": 2}, {"author": "channelclemente", "children": [], "name": "<p>This all started in 2003 when Zaqawi entered Iraq from Jordan in 2003.</p>", "size": 1}], "name": "<p>It all started when Obama announced we would be pulling out of Iraq, creating a power vacuum which gave ISIS the opportunity to grow</p><p>The US should have planned to stay in Iraq and Afghanistan as long as it has stayed in Europe, Japan and other locations on the planet post WWII.<br>And it should be noted, we are still in most of those locations today.</p>", "size": 2}, {"author": "aliswell", "children": [], "name": "<p>Now on THAT I agree with you (except, of course, the people of the ME need to accept Jesus Christ as their Savior.  THEN you would have peace and prosperity).</p>", "size": 0}, {"author": "GeneticalyModified", "children": [{"author": "channelclemente", "children": [], "name": "<p>IMO, they recognize the power of prophecy as a method of persuasion, and how susceptible the West is to risk framed as terror.  The simple fact we've labeled every privy in the world as a terrorist sanctuary we're at war with explains the utility they see in terror as a tactic.</p>", "size": 1}, {"author": "Damascusdean", "children": [{"author": "channelclemente", "children": [{"author": "disqus_hh6Xrjtbul", "children": [{"author": "channelclemente", "children": [{"author": "disqus_hh6Xrjtbul", "children": [], "name": "<p>Stupid projection from the stupid apologist</p>", "size": 1}], "name": "<p>One of your top 10 I see.  OMG.</p>", "size": 1}], "name": "<p>You've obviously never watched the movie, or forgetten the story line.<br>Alternately, you don't know the differences between the characters in the movie and jihadi's</p>", "size": 2}], "name": "<p>It worked as a dramatic element to all our glee in the awful movie Red Dawn that made a fortune at the box office.  Except there we're the jihadi's.</p>", "size": 0}], "name": "<p>Its like the Mafia or any other street gang. You want to control a tough neighborhood, you show people how brutal and serious you are so they back off and give you your space.</p>", "size": 1}, {"author": "agorabum", "children": [], "name": "<p>Not admiration; fear. Fear and patronage. In a tribal society (think: gangs), the leader rewards his fellows and punishes the others / anyone who fights back. Early Saddam (late 60s) took power after a decade of instability, so he focused on fierce repression of anyone who challenged the government, but also massive social programs to improve conditions, and hired Sunnis, especially from his tribe, to positions of power in the oil and banking industries. Saddam actually delivered on a lot of progress and wealth (helped by the high oil prices) until he foolishly started the Iran/Iraq war (thinking that Iran was weak after the revolution, when it drove out a lot of its officer class)</p>", "size": 0}], "name": "<p>The question I am struggling with is why this strongman that came to fill the vacuum had to chose to be so primitively hateful and resort to all these atrocities? My answer to this question is that he probably knew that it sells. The locals are going to admire him for his deeds. Which in turn tells a lot about the \"vast majority\" of peace loving Muslims that live in that area. <br>I am open to other explanations. <br>See, this is not the only hate based organization in the world. US had the KKK not so long ago. How come they stopped to expand and disappeared? It is because they lost the support of the majority of the people who knew better. But ISIS is flourishing. How come it is flourishing?</p>", "size": 0}], "name": "<p>We have to take a step back and recognize that this all started when we toppled Saddam, unleased a Sunni-Shia civil war, and opened up a power vacuum we were unable and unwilling to fill as the colonial powers once did. Then Syria decided to revolt against its dictator and another vacuum opened, along with a wider Sunni-Shia civil war. And then Libya lost its dictator with our help and lo and behold...another vacuum and another playing field. Plus Yemen, which is a perpetual vacuum.</p><p>In the absence of other authorities, a group with an organizing principle, brutal enough to impose its will, and with a savvy leader, can gain ground.</p><p>The Middle east is a mess because it never successfully modernized politically, economically, or spiritually. Problems have accumulated, and there is a bill to be paid. Modern, secular leaders are few and far between. Its hard to imagine how this ends well.</p>", "size": 9}, {"author": "founding_fetus", "children": [], "name": "<p>One of the better columns I've read on the Atlantic website. Thank you for your work!</p>", "size": 8}, {"author": "disqus_YJDxFkhnhw", "children": [], "name": "<p>That's one of the best articles on the subject I have ever seen. Very well written and informative.</p>", "size": 8}, {"author": "gary_talbott", "children": [{"author": "olsonic", "children": [], "name": "<p>I actually agree with this, and I'm surprised we don't encourage more jihadi's to visit their new holy-land. If I were the leader of the free-world, I would be air-dropping these cupcakes over Syria and Iraq with well-wishes in their future confrontation with the full might of our Military power. There is a war going on, and there is no room for jihadi's in the western world.</p>", "size": 3}], "name": "<p>Rather than impeding Muslims from swearing allegiance to the caliphate and joining the Islamic State, western democracies should encourage: Buy them a one-way ticket to Syria. Leave....PLEASE!</p>", "size": 8}], "name": "<P><h2>What ISIS Really Wants</h2></p><P><a href=\"http://www.theatlantic.com/magazine/archive/2015/03/what-isis-really-wants/384980/\">Read the article in the The Atlantic</a></p>", "size": 400}